{
  "subreddit": "ethereum",
  "posts": [
    {
      "title": "Going Bankless (Can I Pay With This Part Five)",
      "author": "Twelvemeatballs",
      "url": "https://www.reddit.com/r/ethereum/comments/1pbptyg/going_bankless_can_i_pay_with_this_part_five/",
      "published": 1764625431.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "This is Part Five of the eight-part series: Can I Pay With This: A stablecoin experiment in Buenos Aires. Thank you to the Ethereum Foundation and the EV Mavericks for their support, without which this experiment could never have happened. Part One: Decentralized or Destitute <-- New? Start here. Money, monkeys and mild terror Part Two: First Contact with Reality KYC on a hostel bunk bed Part Three: WE ACCEPT BITCOIN (sort of) Worst title for an Ethereum subreddit ever Part Four: Eighteen Ways to Pay for Ice Cream Stablecoins, FX hell and a missing keyboard Part Five: Going Bankless <-- You are here From tourist shop hack to cueva contact The problem is, if I want to transact freely here, without putting my trust into a random Web3 app created by strangers who need my KYC but don't need or want to share anything about themself, then I need cash. I find a touristy gift shop with stickers on their window showing dollar signs and pesos. Inside is a young man with a trendy haircut and flashy clothes. He looks hip. Maybe he'll be into the future of finance? He confirms that he's happy to exchange money for me but looks befuddled when I mention USDT, the stablecoin pegged to the US dollar most commonly used in Argentina. \"¿USD?\" \"No. USDT,\" I insist. I have no idea how to say stablecoins. \"Digital dolares?\" He corrects me, Dolares digitales, but it still sounds like there's a question mark at the end of that. \"Sí!\" He looks at me again. \"¿Y quieres cambiarlos?\" And you want to exchange them? I can't tell if he's confused by the concept or just thinks I don't look like the type to come walking into his shop talking about crypto. \"Sí,\" I say again. He's still not sure. \"¿Dolares virtuales?\" I blink. Virtual dollars sound like something you'd need for World of Warcraft. But maybe it's the better way to say it? \"Sí,\" I say again. I am aware that I'm really not keeping up my side of this conversation. He thinks for a moment. \"Tell you what,\" he says in Spanish. \"What I can do is charge your card, hand you cash, you pay a little extra.\" My first thought: isn't that illegal? But of course, so is all of this, trying to buy dollars without going through the official systems. \"How much is a little extra?\" He gives me a rate that is slightly cheaper than Western Union and we are in agreement. I tap my phone, he hands me cash. It feels slick, outside of the system, a benefit to both of us. I feel he understood my intent, even though he couldn't actually do the task. It's a cryptocard with USDT on it. Technically, I have just successfully exchanged stablecoins for cash. Deep down, though, I know it doesn't count. My phone pings: Pomelo has added me to Telegram. I immediately message back with a recap of how I am, because I'm used to my friendship circle who have the memory span of a fruit fly. I am pretty sure I'm not imagining his exasperated tone when he replies to say Yes, I know and I'm working on it. It's fine, I say breezily, I have weeks. No worries. What I really want is for him to say Here's an address. Go there now. Don't look back. before I lose my nerve. Argentina has had strict foreign exchange controls since late 2011 in an attempt to stop capital flight. By 2012, the government flat out banned buying dollars for savings. Restrictions escalated, with online shopping restricted to two parcels a year, $25 max. In 2014, the country defaulted on its debt again.The gap between the official rate and the blue rate was 90%, opening the door for the cuevas offering illicit money exchange. The stage was set for any viable alternative that could avoid government restrictions. Enter stablecoins: digital, virtual, and available to hold without having to trust the bank. In Argentina, and globally, if you're paying attention, trust in banks is gone. People don't hold stablecoins as a symbol of rebellion; it's a working alternate system. It might not be ideal, but it is usable. Pomelo sends me regular reassuring messages and I'm starting to feel like his aging aunt who needs handholding because otherwise she'll start on the gin and then all hell will break loose. That said, maybe gin isn't a bad idea. Finally, finally, a whole three hours later, he sends me a name. A contact who will sell me pesos at the blue rate. He says that his friend is expecting my message. I spend the rest of the evening staring at my phone like it might bite me. Finally, out of pure fear that I'll be one of those people who go to Argentina and write a memoir about almost using crypto, I pick up the phone. I message the Blue Man half in Spanish and half in English, not sure which language he will prefer. I'm searching for the perfect replacement for my pink keyboard when I receive a message from Blue Man in perfect English, confirming that Pomelo told him that I'm wanting to buy pesos, and how much? Suddenly, this isn't a thought experiment anymore. Someone on the other end of a screen is offering to hand me cash, in a city I barely know, in exchange for something that we can't touch. He sends me a link, today's rate. Tells me USDT only. I ask which chain. There's a pause. It sounds like a small thing, but it's not. I want this trade to happen in the context of Ethereum. Tether—USDT—is on nearly every chain now but in Argentina it's commonly used on TRON. Cheap fees, fast transfers, but the ecosystem around it feels like a second-hand suit: functional but a little grimy. I've already decided that if he won't do ERC-20 stablecoin transfer, I'm out. To my relief, Blue Man sends a screenshot from his wallet. Yes, TRON and SOL are at the top but also ERC-20 options: Ethereum mainnet, Arbitrum, Polygon. I stand in the street, phone in hand, trying to get USDT on Arbitrum and then I think, to hell with it. I already have $300 USDT sitting on mainnet, easier just to swap another $100 and eat the gas fees rather than keep chasing some hyperoptimized elegant solution that no one else cares about. Now that we are in technical agreement, Blue Man asks where I am so that he can bring me the cash. I tell him I'm wandering lost trying to find a shop that will sell me a USB keyboard that I don't hate with the passion of a thousand suns, but once I've done that, I'll meet him anywhere. Bonus points if there's coffee. I'm still staring at my phone when I bump into someone. The sidewalk is jammed with people, locals queuing up at a nondescript red doorway. No name, no music, just the smell of hot oil and a chalkboard with today's specials. I join them. When it's my turn to walk inside, I find I'm in a tiny room with chairs up against a thin table on one side and a counter on the other where multiple people are dishing out meals. Tucked in by the doorway is a creased-face old man running the till with practiced precision: cash, card, QR. I ask for lentils, one of the specials. \"We don't have lentils,\" he tells me. \"Oh.\" I have no Plan B. I stand there, lost, an anathema to his fast-moving system. \"We didn't make them,\" he tells me. \"It's too hot.\" \"But I like them,\" I say meekly, as if we are having a conversation. He glares at me. I lean to get view of the chalkboard and blurt out the only other thing that I can see. \"Albondigas con arroz.\" I do not understand why it is too hot for lentils and not too hot for meatballs with rice but no one else seems concerned. The man scribbles the price on a small piece of paper and hands it to me. I shove it in my pocket, grumpy that he doesn't trust me to understand the numbers. \"I'll pay by QR,\" I say, like I'm a local just masquerading like a lost tourist. He waves me to the counter, a narrow area crammed with hungry office workers and freelancers looking ready to make their next deal. The man behind the counter is moving fast, handing out plates of food. Then he barks for the next person to give him their order. With horror, I realise that I have to hand over the scribbled number on a slip: it wasn't for me, it was for this guy. I hand him my rumpled slip and ask for meatballs to eat here, perching on a high stool. A few minutes later, he slides a plate towards me, heaped with rice and three large meatballs. \"Albondigas para dos,\" he says. \"No, no.\" This is meatballs for two, and I'm only me, I say, confusedly. He pauses, his face creased with concern. What's wrong? Do I not wan this? I'm breaking the system again. \"Soy sola,\" I say, I'm alone, and then spot my mistake. I think I just informed the guy that I'm single. He holds my gaze. No one else claims the plate. And who the hell serves three meatballs for two people. Never mind, I tell him. It's fine. Don't worry. He frowns and then flies back into chaotic motion, taking orders, handing out the results. I'm halfway through my meal when I hear it again: his voice, handing a takeaway box to someone else. Para vos. For you. Singular. Direct. Only in Argentina. Even the simplest of interactions are fraught for me here. I pull out my phone to get my next instruction from Blue Man. His text says I don't need to come to him. Finish my shopping. He can send a motorbike courier to me. This is not what I expected. I thought that we would meet in some indoor back room. Some fluorescent-lit space with a counter and chairs and CCTV. And witnesses. I remember my hostel manager: never make transaction on the street. I ask him straight: I meet a guy on a motorbike who just... pays me? Yes, exactly. Once the funds hit the Blue Man's wallet, motorbike man will hand me the envelope. An envelope. Could be anything. Receipts. Cut-up newspapers. A polite threat. And how is motorbike man going to know that the money went through? I don't like any of this. I message back that I need to know the envelope actually has money in it. Before I do the transaction. I admit that I don't know how to do this in a trustless way. There is no problem, he tells me. His very good friend Pomelo recommended him to me, he reminds me. This is meant to represent trust. I message Pomelo: is he actually a very good friend? Would he trust him with cash? At the same time I message Blue Man again. Pomelo is not my good friend. He's just some guy I met in an ice cream shop. Somewhere between all this, I find a keyboard. It's not pink but it will do. I want to point out to Blue Man that I'm a woman alone, in a foreign city, explain why this setup is starting to feel physically dangerous. But he already knows that I'm a foreigner. Assumes I don't speak Spanish. My real name. He knows a hell of a lot more about me than I do about him. There really isn't anything I can add to that. A message from Pomelo. Yes, this is a real friend and yes, he'd trust him. They could be in this together, of course. But Pomelo is plugged into the local Ethereum scene. He has a reputation. Something to lose. Blue Man is waiting. I stall. Tell him that I'm looking for a place to meet the courier. \"As long as I can see the cash first,\" I text, \"we're good.\" I find a place to sit in the middle of the avenue, the Obelisk towering above me, and try to think this through. I've moved from my hostel room to a dingy hotel on the other side of the Avenida. Motorbike guy could meet me there. Not my room—god no—but in the lobby. The front desk is staffed by a guy who looks like personal protection, with arms the size of my thighs. If it goes sideways with motorbike guy, he might not take my side. He might not even look up. But it's indoors, big windows, a busy street. CCTV, probably. I don't care about my stuff. If the burner phone gets grabbed, it doesn't matter. The wallet is synched elsewhere. I have already learned where to buy a keyboard. What I need is at least a hint of physical protection. I am not actually able to put my trust into strangers with pseudonyms and cash in envelopes. I send Blue Man a screenshot of $400 in pesos pegged to the blue rate. It's up ten pesos since this morning. He offers a round number, asks if I want large bills or small. He's happy with the lobby. He's going to come personally, he tells me, so that I can feel more comfortable. This means that Blue Man will know where I'm staying, not just some guy on a motorbike. But at this point, I'm out of ideas. Another message from Blue Man. \"Can we do this now?\" I tell him I'll be there in twenty. Up next is Part Six: Trustless, My Ass (Trading with the Blue Man) I have some personal issues going on, so we're taking a brief break. I'll be back with Part Six toward the end of the week."
    },
    {
      "title": "Daily General Discussion December 01, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1pb54eb/daily_general_discussion_december_01_2025/",
      "published": 1764568945.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "Introducing Solidity Modules: How to Build Smart Contract Systems Without Inheritance or Solidity Libraries",
      "author": "mudgen",
      "url": "https://www.reddit.com/r/ethereum/comments/1pbgedl/introducing_solidity_modules_how_to_build_smart/",
      "published": 1764604532.0,
      "thumbnail": null,
      "external_url": "https://x.com/mudgen/status/1995513333139513796",
      "site_name": "X (formerly Twitter)",
      "favicon": "https://abs.twimg.com/responsive-web/client-web/icon-ios.77d25eba.png",
      "description": null
    },
    {
      "title": "What’s the hardest bug you’ve ever had to track down in a Solidity project?",
      "author": "SolidityScan",
      "url": "https://www.reddit.com/r/ethereum/comments/1pbjn9d/whats_the_hardest_bug_youve_ever_had_to_track/",
      "published": 1764611682.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "We’ve all run into at least one Solidity bug that took way longer than it should’ve. Sometimes it’s a storage layout issue, sometimes it’s proxies behaving weirdly, an inheritance quirk, calldata alignment, math edge cases, or a subtle security assumption that only shows up under certain conditions. Curious to hear from other devs what’s the toughest or most confusing bug you’ve had to debug in a smart contract, and how did you finally track it down?"
    },
    {
      "title": "Running my first trading war and am giving away some eth as top prize. This is a game I've been developing and am basically willing to pay for players!",
      "author": "hupcapstudios",
      "url": "https://www.reddit.com/r/ethereum/comments/1pbhd31/running_my_first_trading_war_and_am_giving_away/",
      "published": 1764606665.0,
      "thumbnail": "https://external-preview.redd.it/g_s5_-SszdKQAKOe0s1pC8oudkgYJxkg7UEY-c5IJUA.png?width=320&crop=smart&auto=webp&s=9b2ef8d2e3b129f0e1c6f5e3688b7b997bc2a5e8",
      "external_url": "https://eth.botwars-c.com/game_room",
      "site_name": "BotWars-C",
      "favicon": "https://eth.botwars-c.com/apple-touch-icon.png",
      "description": "Build, train, and compete with trading bots in simulated crypto markets. Climb the leaderboard, win credits, and redeem for ETH."
    },
    {
      "title": "Yearn Finance Exploited for Over $3 Million Worth of Assets",
      "author": "iffattalll",
      "url": "https://www.reddit.com/r/ethereum/comments/1pb39dn/yearn_finance_exploited_for_over_3_million_worth/",
      "published": 1764563061.0,
      "thumbnail": null,
      "external_url": "https://medium.com/@wzrqjs/yearn-finance-exploit-analysis-c0e89979672a",
      "site_name": "medium.com",
      "favicon": null,
      "description": "The Yearn Finance yETH vault was exploited for over $3 million. The attacker leveraged a dust attack combined with a flash loan to destabilize the underlying pool. In this case, the locus of the root cause was a flawed mathematical singularity in the _calc_supplyfunction that implemented the Newton-Raphson solver. The attacker submitted dust or small amount of liqudity into the skewed pool, causing the _calc_supplyfunction to diverge which forced the contract to incorrectly calculate the pool’s value as infinite. As a result, the attacker was able to practically mint millions of dollars worth of liquidity share for a bare-minimum cost."
    },
    {
      "title": "How RWA tokens(ERC3643) pegged with their underlying asset?",
      "author": "avik_saikat007",
      "url": "https://www.reddit.com/r/ethereum/comments/1pb77sj/how_rwa_tokenserc3643_pegged_with_their/",
      "published": 1764576545.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "I have the following questions regarding ERC3643 tokens, widely known as RWAs: Say for NVDAonThe asset value is determined from the NVDA stock, right? But how is the value of the NVDAon token changing on non-trading days(Weekends & holidays)? Can the value of the NVDAon(the RWA) Becomes zero if all of the holders withdraw their holdings, just like any standard ERC-20 token? If the value of the ERC3643 token is pegged with the underlying asset, then how are they different from each other, but with this much larger margin? ( As of 1.12.2025, NVDAon is 174.80 & NVDA is 176.98). This means their value is being determined based on their traded value?"
    },
    {
      "title": "Part Four of Can I Pay With This?: Eighteen Ways to Pay for Ice Cream",
      "author": "Twelvemeatballs",
      "url": "https://www.reddit.com/r/ethereum/comments/1patml2/part_four_of_can_i_pay_with_this_eighteen_ways_to/",
      "published": 1764537125.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "This is Part Four of the eight-part series: Can I Pay With This: A stablecoin experiment in Buenos Aires. Thank you to the Ethereum Foundation and the EV Mavericks for their support, without which this experiment could never have happened. Catch up here: Part One: Decentralized or Destitute Money, monkeys and mild terror Part Two: First Contact with Reality KYC on a hostel bunk bed Part Three: WE ACCEPT BITCOIN (sort of) OK, that was the worst title for an Ethereum subreddit ever Part Four: Eighteen Ways to Pay for Ice Cream <-- You are here Stablecoins, FX hell and a missing keyboard --- My first real encounter with hyperinflation comes with breakfast. I've been frequenting a bakery on Avenida de Mayo for their breakfast combo: A cup of coffee with two tiny croissant-like things stuffed with ham and cheese. Last week, the price was 6,000 pesos. This week, it's 8,200. I realize with a start that nowhere in this city have I seen a printed price. They are all on chalkboards or handwritten with ballpoint pen on menus that have been updated several times already. No one but me expects things to cost the same this week as they did last week. I'm converting small amounts of money every time to motivate me to try harder to find a way to get cash for stablecoins. The actual result is that I keep running out of cash. I've been told not to use ATMs as they charge an exorbitant fee but I'm willing to pay a fee in this case, or at least find out what it is. I find a bank with an ATM which seems like the most likely bet and tap my card. It's accepted and I have a few options for withdrawing cash, from 10,000 pesos to 50,000 pesos. That's not a lot. I tap 50,000 pesos. An error. That is over my daily limit. I back up and check my bank. Nope. Nowhere near my daily limit. This is a limit from the cash machine, not from my side. I go back to the machine and work my way down the list. 50, 40, 30. Finally, it agrees that I may have 30,000 pesos, about twenty dollars, but only if I pay a $7 transaction fee. I politely decline. Obnoxiously, the charge shows up as pending on my card despite my backing out: the funds are released the following day. I have learned my lesson about ATMs. Binance and Bybit advertisements are posted all over the city, bold and bright like emergency exits. These are centralized exchanges, the easy way to hold crypto. Instead of having a crypto wallet, the exchanges hold your funds for you. It's centralized, permissioned, requires full trust in the exchange to do right by you and to continue existing. Trading trust in banks for loosely regulated financial institutions. In Argentina, this is not necessarily a bad decision. Over my coffee, I scan for crypto news. El Submarino Jujuy, a provincial news site, has a long detailed piece on how to monitor five simultaneous exchange rates: official, blue, MEP, CCL and crypto dollars. What surprises me is how little explanation there is. The article assumes that the reader already has an exchange account, already holds ETH and BTC. There's no explanation of wallets or blockchains, only strategy. I cannot imagine an article like this in The Guardian or The New York Times, unless it had a sidebar on \"The mythology of crypto\" and a quote from a distressed 60-something who lost everything. And yet, while we are excited about smart contracts, leverage and liquidity protocols, most people here don't seem to be talking about trading. They're holding stablecoins, not for yield, not for innovation, but simply to avoid erosion. They are content to use centralized exchange cards, converting at checkout, side-stepping the crumbling peso. I do it too. Tapping my cards and scanning my QR apps for as many transactions as possible so I can limit my exposure to the peso. \"May I?\" An old man wants the other half of my table. He looks me over. \"Where are you from?\" I tell him. He nods knowingly and then asks, \"Is that Occidental or Oriental?\" This is not a question that I was expecting. \"Occidental, I think?\" He nods again, as if he knew that all along. When I go back to my phone, I get a lucky break—an event posted to Twitter: Stablecoin Ice Cream. A challenge to meet at Crecimiento to descend on the best heladería in Buenos Aires. \"Let's buy some ice cream using ONLY stablecoins.\" I sign up immediately. There are prizes for the best and worst FX rate. More people add more prizes, including 1000% cashback for using WalletConnect to pay for your ice cream The organizer thought probably no one would come. In the end, eighteen of us show up and he's slightly panicked that he didn't warn the ice cream shop. The server does his best to cope with a slightly feral crowd of crypto enthusiasts descending on him on a Friday afternoon. Someone convinces him to install a Settle wallet so that they can transact in USDC for the ice cream. It almost works until the owner intervenes and insists: pesos only. We each choose two scoops of ice cream. I get spicy mango and pistachio, which turns out to be an inspired combination. I scan the QR code to pay with Peanut. It fails. I switch to my trusty crypto card, which works. Someone else tries to scan the QR code with their Metamask wallet app, which doesn't. We test Peanut (which works for everyone else), Gnosis Pay, Yodl, Ready (Starknet), Redot. Quite a few give up and pay in cash. The organizer posts an update on Twitter: 50% of participants who are actually working in 9-5 jobs in web3 today couldn't pay with stablecoin on-chain. The FX rate varies by application but also by when the ice cream as bought, with noticeable volatility even on the same wallets over the half hour we took to order. I win a prize for the third-worst FX rate: 25 $BOND tokens. Now I have to find out what $BOND is. No one claims the 1000% cash back for using WalletConnect. No one can work out how. But it's a success. I have another two apps to try. A third, Luca, is tackling exactly the problem that I was thinking about: onboarding regular people to deposit their savings in stablecoins to gain yield from DeFi, with no need to understand any of the machinery. I explain about trying to use crypto in Buenos Aires, that I've still not seen any way to buy pesos with stablecoins. \"Why do you want to?\" I have DeFi cards. I have an app that scans QR codes. I can pay seamlessly in restaurants and ice cream shops and kiosks. The transaction goes through and boom, it's on-chain, final, and the grocer gets paid. What more do I want? And I'm still stuck on the idea of pure decentralization. An actual wallet-to-wallet transaction. I don't care what I buy: pesos or empanadas or a late night glass of wine. I just want to cut out the middleman. Decentralized. Permissionless. Trustless. I mean technically, yes, it's permissionless. No one can stop me from submitting a transaction to a street vendor. I can sign it. It'll show up on a block explorer. But I can't force the street vendor to accept my transaction and give me empanadas. You can't route around human consent. I feel stupid explaining how confused I feel about all this, so instead, I try to be amusing by telling them the story of buying candy with BCH. An Argentine with a cone holding two identical scoops of pink-orange ice cream explains to me that to trade stablecoins for pesos, you need a friend who knows a friend. \"That's how it works in Buenos Aires.\" Someone murmurs cuevas in the background. He nods, that's what he's talking about. Blackmarket traders. They no longer operate in actual caves, I've read, just secret spaces. Tiny, nondescript back offices, hidden behind the magazine racks inside a news kiosk, in the back of a lingerie shop, or up a dodgy elevator in an old building. It's exactly what I am wondering about. It sounds scary. I also wonder: What kind of lunatic gets two scoops of ice cream and then only chooses one flavor? He tells me that it's all pomelo, grapefruit, and that he has no regrets. \"So,\" I say, trying to look cool about asking the Pomelo-loving-man half my age for underground stablecoin hookups in an ice cream shop. \"Do you have a friend?\" \"I do.\" And just like that, I have a way forward. I will either make good on my challenge or get murdered in a Buenos Aires back alley. Luckily, I don't have enough crypto to be worth murdering, which even the most greedy bad guy can guess from my faded jeans and sweat-shop t-shirts that I've been hand-washing in the sink. I find Pomelo again before the event ends, refusing to risk his disappearing into the shadows of Subte Línea D. I hand him a business card. \"It has my email address,\" I explain. He looks at me like I just gave him a fax number. \"Don't you have Telegram?\" Of course I do, yes, and he promises to add me as a contact. It's not a big deal though, Pomelo warns me. It sounds like it's pretty shady but really it isn't. \"I just want to be able to say that I've done it,\" I tell him. I promise that I'm not expecting anything cloak and dagger. He'll be in touch, he says. I try not to show how excited I am. The following day is Pride and Avenida de Mayo is a glorious chaos of queer, cocktails, drums, glitter and screaming. I bounce through the crowds all afternoon, sipping Fernet and Coke and trying to pretend like it doesn't taste like cough syrup. Later, walking back through Microcentro on a piece of sidewalk just wide enough for one polite person, I feel something brush the top of my head. I stop, look up, look back, reach into my hair like a chimp checking for lice. Two men and a woman, walking tightly together, pass me. As they do, the woman says something low and quick in Spanish, too fast to understand, too deliberate to ignore. I think she's telling what's in my hair and I'm mostly hoping that it isn't bird shit. But I'm also thrown. She's not smiling. She's not trying to be helpful. I pat my head a bit more, finding nothing. As I continue, I see the same trio standing in a doorway, talking. As I pass, they fall in behind me again. I'm still wondering what the woman said to me, and why. It's not until I am back in my room that I realise my back pocket is empty. I have been pickpocketed. They stole my pink keyboard. Part Five: Going Bankless (From tourist shop hack to cueva contact)"
    },
    {
      "title": "Solidity Team Plans to Remove Inheritance From the Language Entirely",
      "author": "mudgen",
      "url": "https://www.reddit.com/r/ethereum/comments/1pam9ew/solidity_team_plans_to_remove_inheritance_from/",
      "published": 1764519659.0,
      "thumbnail": null,
      "external_url": "https://x.com/mudgen/status/1994927714726212077",
      "site_name": "X (formerly Twitter)",
      "favicon": "https://abs.twimg.com/responsive-web/client-web/icon-ios.77d25eba.png",
      "description": null
    },
    {
      "title": "Daily General Discussion November 30, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1paavb7/daily_general_discussion_november_30_2025/",
      "published": 1764482460.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    }
  ],
  "fetched_at": "2025-12-02T02:58:26.441250+00:00"
}