{
  "subreddit": "Bitcoin",
  "posts": [
    {
      "title": "How we be going out tonight Bitcoin fam",
      "author": "Pristine_Hurry_4693",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pbhb3y/how_we_be_going_out_tonight_bitcoin_fam/",
      "published": 1764606547.0,
      "thumbnail": "https://external-preview.redd.it/am95bXc2YzhkbTRnMWF0d_ybNl61nKzjtizlSsbcnK4on9S2X2VMVYu8gbnJ.png?width=640&crop=smart&auto=webp&s=2868c69a059b40551a5f04ef79ceda31da27b018",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "The eyes that sees 🤝",
      "author": "MrMBTC",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pbf498/the_eyes_that_sees/",
      "published": 1764601609.0,
      "thumbnail": "https://preview.redd.it/blumjmzjyl4g1.jpeg?width=640&crop=smart&auto=webp&s=5d24e6dbd469c2b67aa050c7ffa9e0c18064021d",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "HA-HA! Your dip dipped!",
      "author": "NorthComparison4356",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pb9hzj/haha_your_dip_dipped/",
      "published": 1764585334.0,
      "thumbnail": "https://preview.redd.it/95ua5ezylk4g1.jpeg?width=640&crop=smart&auto=webp&s=7228962735a17def74f37bf535c3ded10f3c5a3a",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "and I got my paycheck today..…. (I will rampage when my dip dipples too!)"
    },
    {
      "title": "Bart Simpson pattern confirmed !",
      "author": "LordVixen",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pb32mx/bart_simpson_pattern_confirmed/",
      "published": 1764562493.0,
      "thumbnail": "https://preview.redd.it/m6g4lhh6qi4g1.png?width=320&crop=smart&auto=webp&s=b5cf22eebe07169f274f18fb6a3ee8eb4995b097",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "oh yea",
      "author": "Repulsive-Box-6516",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pbhsb5/oh_yea/",
      "published": 1764607624.0,
      "thumbnail": "https://preview.redd.it/6o5uefwfgm4g1.jpeg?width=640&crop=smart&auto=webp&s=61cf6dce2ec5186ce25bbf35629da3f3930ca19b",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "Nothing is different about this cycle, and no crypto is not dying",
      "author": "jdellama",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pbhwmu/nothing_is_different_about_this_cycle_and_no/",
      "published": 1764607896.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "With so much liquidity injected into the market and ETFs and global acknowledgment of crypto, I too thought that this cycle may be different. As we get older. We learn that nothing is different, in all aspects of our lives. History will always repeat itself. I have enjoyed being involved in the crypto community since 2016, and I can't explain how many times my wife and family have told me to sell everything. We all know that Bitcoin runs in a 4-year cycle, and historically, about 6 to 12 months after the halving, Bitcoin works towards its all-time high as well as all of the altcoins. After the all-time high, Bitcoin has historically settled down into a lengthy depression or winter, along with all of the other altcoins. Again, I thought this cycle may be different, but the halving was on April of 2024. That makes $126k the new all-time high, and now we are in winter. We will likely be in winter for a couple of years. This is the time to accumulate and be patient, values may also and likely go lower. DCA is the way and expect a minimum of 4 year hold"
    },
    {
      "title": "It's that time again",
      "author": "yoobermcruber",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pazogz/its_that_time_again/",
      "published": 1764552789.0,
      "thumbnail": "https://external-preview.redd.it/Zm5oeGJwMmV4aDRnMTR_Q4M4BKufpM4-TNoMs1I71anESXimVF_5XX8p0SHs.png?width=320&crop=smart&auto=webp&s=88bce8223dee52b0a045bdeb0ae7b276a9444889",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "Interesting info",
      "author": "TrueTheme4542",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pbiji6/interesting_info/",
      "published": 1764609274.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Friends, the fix is in… I don’t say that lightly. I don’t say it for shock value. I say it because for years, I’ve been warning you this exact moment would arrive… The moment when Wall Street would stop pretending – and finally reveal the conspiracy they’ve been building behind closed doors. And if you want to understand what’s happening right now with bitcoin, you need to look back at one of the most infamous financial scandals in U.S. history. Back in 1869, two powerful railroad titans – Jay Gould and James Fisk – attempted to corner the gold market in what became known as “The Black Friday” gold scandal. They bribed government officials, manipulated markets, and used political pressure to keep the U.S. Treasury from selling gold. Their goal was simple: control the supply, dictate the price, and crush anyone who stood in their way. By some estimates, they walked away with up to $12 million in gold profits – that’s a staggering $285 million today’s dollars. When I look at what Wall Street is doing today, I see the exact same playbook – only modernized. Back then, they tried to corner the gold market. Today, they’re trying to choke off the bitcoin supply by changing the rules of who’s allowed to access it. Different century. Same greed. And just like I warned you years ago, that Wall Street cabal has finally made its move. The Great Crypto Conspiracy Continues For years, Wall Street pretended bitcoin was worthless. They mocked it. They smeared it. They called it criminal money. They told everyday people – you – to stay away. But I knew better. That’s why back in 2018 (when bitcoin was around $6,400), I held a special briefing with media personality Glenn Beck called The Great Crypto Conspiracy. During this briefing, I warned anyone who would listen that Wall Street’s plan was to terrify the public out of crypto… Drive prices to the ground… And scoop up the greatest asset ever created at fire-sale prices – while everyday folks ran for the exits. Teeka warning about the Great Crypto Conspiracy during a special briefing in 2018 I also predicted the same powerful insiders who mocked bitcoin would one day build the rails to control it. Most people didn’t believe me back then. But today, it’s undeniable. Because the very institutions that told you bitcoin was a fraud… are now rewriting the rules of global finance to make sure they get to control it. Wall Street’s “Assassination” Attempt And that brings me directly to the latest chapter in this conspiracy. It involves two of the biggest financial firms on Wall Street: MSCI and JPMorgan Chase. Let’s start with the first player in this conspiracy: MSCI, short for Morgan Stanley Capital International. MSCI is the giant behind the stock indexes that determine where nearly $17 trillion in passive investment capital flows. Its benchmarks shape everything from mutual and exchange-traded funds (ETFs)… to the portfolios of the world’s largest institutions. That makes it the kingmaker of passive investments. Last month, MSCI began considering a rule change that’s essentially a guided missile aimed at crypto treasury companies: Banning any company from its global indexes if 50% or more of its assets are held in digital assets. A final decision is scheduled for January 15, with any index adjustments arriving in February 2026. This isn’t about “risk.” This isn’t about “volatility.” This is a decapitation strike. And the target is obvious: Strategy (formerly MicroStrategy). Back in 2020, Strategy became the first publicly traded company to add bitcoin to its corporate treasury. Today, it’s the largest publicly traded bitcoin proxy in the world. And because it’s included in major MSCI indexes right now, millions of everyday investors can gain bitcoin exposure simply by owning Strategy stock. To Wall Street, that’s unacceptable. Why? Because Strategy gives investors bitcoin exposure with no middleman and no fees. So what does MSCI do? It proposes moving the goalposts by creating a new “50% digital asset” rule that would ban these types of companies from its indexes. Since rumors about the rule change began circulating last month, Strategy’s shares have been down as much as 49%. Friends, this isn’t risk management. This is an attempted corporate assassination. According to JPMorgan analysts (more on them in a moment), of Strategy’s roughly $50 billion market cap, about $9 billion sits in passive vehicles like ETFs and mutual funds that track these very indexes. Simply removing Strategy from MSCI could trigger roughly $2.8 billion in forced passive outflows, with as much as $8.8 billion at risk if other index providers follow its lead. It’s the same tactic Gould and Fisk used in 1869: rewrite the rules, corner the market, and break the competition so the insiders can take control. The Smoking Gun Friends, if you still have any doubt – any shred of uncertainty about whether this is simply business as usual or a grand conspiracy like The Black Friday gold scandal – let me show you the smoking gun… Because at the same time MSCI is trying to ban bitcoin treasury companies, JPMorgan is rolling out a brand-new product that gives investors exposure to bitcoin. They call it a “bitcoin-linked structured note.” But let’s call it what it really is: A Wall Street product designed to do one thing: skim profits from regular investors while pretending to offer safety. These notes are essentially bitcoin bonds – complex debt instruments that give you exposure to bitcoin’s price (specifically linked to BlackRock’s IBIT ETF), served with a dose of leverage and a hefty stack of bank fees. Think about the hypocrisy. Wall Street doesn’t want Strategy giving you bitcoin exposure without fees attached. But they’re more than happy to hand you bitcoin exposure… as long as they’re the ones earning the fees. JPMorgan filed the new structured notes product with regulators last week. And once you see how this scheme works, you’ll understand exactly how Wall Street rigs these “safe” bitcoin notes to their advantage – not yours. When you buy a $1,000 note like the one JPMorgan is offering, the moment the ink dries, it’s usually only worth about $925 to $950. In other words, you’re instantly down 5% to 7.5% – money that goes straight into the bank’s pocket as a structuring fee and commission. You start the investment in a hole. And then there’s the cap. Many of these notes promise a little leverage on the upside, but they quietly limit how high your gains can go. For example, if bitcoin shoots up 200% in a monster rally, your note might stop paying out at 88% (or lower). That means you absorb all the volatility, all the risk… while Jamie Dimon’s firm pockets the life-changing upside. Friends, do you see the game? They want to use index rules to prohibit Strategy from issuing securities backed by bitcoin – just so they can turn around and sell you a structured note backed by bitcoin. They don’t want to ban the asset; they want the monopoly on packaging it. This is The Great Crypto Conspiracy in a nutshell. Knowledge Is Your Power Why is Wall Street so afraid of Michael Saylor’s Strategy? Because it did something that threatens their fee-generating machine. Strategy didn’t just give investors direct exposure to bitcoin through its shares. It introduced a Series A Perpetual Strike Preferred Stock – a new type of security that lets investors earn yield backed by bitcoin itself. This directly competes with the high-fee, complicated derivatives that banks like Goldman Sachs and JPMorgan use to generate massive profits. If Strategy succeeds in creating a liquid market for bitcoin-backed preferred equity, it cuts the banks out of the equation. Wall Street fears a future when companies act as their own banks, hold their own assets, and issue their own capital instruments, bypassing the traditional financial toll collectors. And that’s the threat they can’t ignore. Friends, this is the moment I’ve been warning you about since the day I first exposed what I called the Great Crypto Conspiracy. For years, people rolled their eyes when I said Wall Street would eventually try to control bitcoin the same way Gould and Fisk tried to corner the gold market in 1869. They want to kill the independent bitcoin treasury companies, so the only way you can access this asset class is through their turnstiles, paying their toll. The titans of Wall Street have capitulated on the value of bitcoin. They know it’s staying. Now they are just fighting over who gets to sell it to you. But here’s the part the financial elite never saw coming: You’re no longer in the dark. You’re no longer the victim in the rigged game. Don't let them shake you out. You’re early, informed, and standing on the right side of the greatest financial shift since the birth of the stock market. You don’t need Wall Street to spoonfeed you a watered-down, high-fee version of bitcoin. A simple ETF like IBIT is all you need. And if you want to purchase and hold your own bitcoin, just get a Ledger hardware wallet and self-custody for free. No matter the volatility, no matter the fear, uncertainty, and doubt (FUD) over this MSCI issue – know this: Bitcoin and crypto assets are here to stay. Don’t let Wall Street’s battle for this market scare you out of this asset. Wall Street is playing the long game. They’ll happily scare you now and coddle you later to get you back in. Just so long as they’re the guys selling you access. So pull the camera back and know that no matter the volatility, the long-term trajectory of bitcoin is higher. The ride will be bumpy for the bitcoin treasury companies… But so long as they’re not forced to sell their bitcoin, it doesn’t matter what MSCI does. The upward price action of bitcoin will ultimately reignite the prices of their stocks higher. Let the Game Come to You! Big T"
    },
    {
      "title": "The true cost of trying to predict the Bitcoin market.",
      "author": "Cryptomuscom",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pbbztd/the_true_cost_of_trying_to_predict_the_bitcoin/",
      "published": 1764593570.0,
      "thumbnail": "https://preview.redd.it/lsclmr9mal4g1.jpeg?width=640&crop=smart&auto=webp&s=834c1a65e28f27dec2dd7c39184b06a5935fcdbc",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "Are you buying?",
      "author": "febio1",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pbdvrs/are_you_buying/",
      "published": 1764598597.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Hello guys, This is not a “will it dip more” or “should I wait?”. I am DCA type and also buying the dips when it dips (so as right now). This is more a discussion I wanna have with you. Are you currently buying besides your DCA? Are you waiting for a maybe even bigger dip since btc is so insecure right now? How you feeling? Cheers mates"
    }
  ],
  "fetched_at": "2025-12-01T20:45:22.229712+00:00"
}