{
  "subreddit": "ethereum",
  "posts": [
    {
      "title": "Daily General Discussion December 03, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1pcwf5g/daily_general_discussion_december_03_2025/",
      "published": 1764741636.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "EIP-7918 in Fusaka: 3 reasons and 1 trick",
      "author": "AElowsson",
      "url": "https://www.reddit.com/r/ethereum/comments/1pd22ch/eip7918_in_fusaka_3_reasons_and_1_trick/",
      "published": 1764762452.0,
      "thumbnail": "https://external-preview.redd.it/IowdQowt3HjVc2_v7hjaoxOtWACbeO7t7eNBcXnNun0.jpeg?width=640&crop=smart&auto=webp&s=52a3a1ec89b6aac1fc5fa96fbc775c1141dc660d",
      "external_url": "https://notes.ethereum.org/@anderselowsson/EIP-7918-3-reasons-1-trick",
      "site_name": "HackMD",
      "favicon": "https://notes.ethereum.org/apple-touch-icon.png",
      "description": "# EIP-7918 in Fusaka: 3 reasons and 1 trick  Tonight, Fusaka goes live and Ethereum updates its blob"
    },
    {
      "title": "Anoma just activated an entirely new state machine on Ethereum and everyone is too busy farming points to realize what just happened",
      "author": "Direct_Reporter9112",
      "url": "https://www.reddit.com/r/ethereum/comments/1pcj7vc/anoma_just_activated_an_entirely_new_state/",
      "published": 1764706627.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Only in crypto can someone ship a whole new state architecture onto Ethereum mainnet and the collective reaction is basically “cool anyway who’s getting the next airdrop.” Anoma quietly deployed the Resource Machine and it’s honestly wild how little attention it’s getting. Here’s the part people are already getting wrong Anoma is NOT a privacy project. Yes it has privacy baked in. Yes it uses commitments and nullifiers. Yes it uses a zkVM. But the whole point isn’t “Zcash on Ethereum.” It’s that Anoma is introducing a completely different state model that just happens to make privacy possible but it goes so much further. This thing isn’t a rollup. It’s not a coprocessor. It’s not an “L2 but with extra steps.” It’s a parallel state machine living on Ethereum. A second way to define and verify state transitions. Like if the EVM suddenly had a strange, overpowered cousin that grew up reading Zerocash papers and lifting weights with RISC0. Instead of giant mutable smart contracts, everything becomes tiny immutable resources verified with commitments and nullifiers. Off chain computation. On chain verification. Millions of private micro-objects instead of one giant public diary. The EVM suddenly looks like a 2006 Nintendo DS sitting next to this thing. And the apps you can build aren’t vaporware. They’re what our industry desperately needs NOW: Private swaps that still use Uniswap liquidity A private Gitcoin where your conditions stay hidden Dark pools without liquidation snipers breathing down your neck Private payments across any EVM chain like it’s nothing Again none of this makes Anoma “a privacy project.” That’s like calling Ethereum “a database project.” Privacy is just a side effect of the state model. The real unlock is intent-centric apps, parallel execution, flexible off-chain computation, and a verification-first design that makes the EVM look hilariously outdated. But the timeline is still spreadsheeting loyalty points like it’s Web2 airline rewards season. Not telling you to buy anything. Just saying a parallel state machine literally booted up inside Ethereum and most people won’t realize what that means until they see it at a multibillion FDV and suddenly “remember hearing about it early.” https://ethresear.ch/t/the-anoma-protocol-adapter-is-live-on-ethereum/23466"
    },
    {
      "title": "Poll (for signaling purposes only) for portmanteau for Heka + Bogotá upgrade",
      "author": "abcoathup",
      "url": "https://www.reddit.com/r/ethereum/comments/1pcwzpv/poll_for_signaling_purposes_only_for_portmanteau/",
      "published": 1764743625.0,
      "thumbnail": "https://external-preview.redd.it/pLYfQIFvue7Tig0Wx7mJmq_5XPfVkCsh5yrMvFmtATg.png?width=640&crop=smart&auto=webp&s=5fdbed10272c86384eb3ec8425b98b076d3acbbf",
      "external_url": "https://ethereum-magicians.org/t/portmanteau-for-heka-bogota-upgrade-after-glamsterdam/26400",
      "site_name": "Fellowship of Ethereum Magicians",
      "favicon": "https://ethereum-magicians.org/uploads/default/optimized/2X/3/3a633db8b362151a5dd196670cef12dc5deafc05_2_180x180.png",
      "description": "A portmanteau (Portmanteau generator) is needed for Heka + Bogotá upgrade after Glamsterdam  The consensus layer uses star names for upgrades whilst the execution layer uses Devcon cities.  See: Post-Merge Network Upgrade Naming Schemes  Recent upgrade names:   🦉 Shapella (Shanghai + Capella) 🐡 Dencun (Cancun + Deneb) 🦒 Pectra (Prague + Electra) 🦓 Fusaka (Fulu + Osaka) Glamsterdam (Gloas + Amsterdam) Heka + Bogotá  (Apologies if I am stepping on the process for selecti..."
    },
    {
      "title": "What utility can ethereum or ETH provide to the average person today?",
      "author": "hau5keeping",
      "url": "https://www.reddit.com/r/ethereum/comments/1pck131/what_utility_can_ethereum_or_eth_provide_to_the/",
      "published": 1764708465.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Why should the average person be excited about ethereum and/or ETH? What specific real world use cases are available to the average person today?"
    },
    {
      "title": "Been out of the loop for some time. Whats the go-to wallet solution these days?",
      "author": "TripleSpeeder",
      "url": "https://www.reddit.com/r/ethereum/comments/1pcz1jq/been_out_of_the_loop_for_some_time_whats_the_goto/",
      "published": 1764751311.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "For several years I've been using the combination of frame.sh + brave browser plugin, backed by the Lattice1 hardware wallet. This combo works basically fine, but it seems there is not much development going on. I really did not follow ethereum ecosystem changes in recent years. Are there other/newer projects I should have a look at? Especially frame.sh always feels somewhat clumsy to use - I would love to have something that feels more integrated into my desktop."
    },
    {
      "title": "Daily General Discussion December 02, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1pc0uyk/daily_general_discussion_december_02_2025/",
      "published": 1764655258.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "never NOT a good day to be converting people into self-custody",
      "author": "haochizzle",
      "url": "https://www.reddit.com/r/ethereum/comments/1pc6mkk/never_not_a_good_day_to_be_converting_people_into/",
      "published": 1764676776.0,
      "thumbnail": "https://preview.redd.it/ij9j10k65s4g1.png?width=640&crop=smart&auto=webp&s=8246894b1f95aadc83dfc3846cbb36a9979faf27",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "redacted for privacy, but… a friend of mine — who is literally a dev on a pretty big crypto wallet team 🤯 — finally took the self-custody plunge after I gave him the pitch. this is him buying his very first hardware wallet today 🤝 A.B.C. = always be convertin’"
    },
    {
      "title": "Going Bankless (Can I Pay With This Part Five)",
      "author": "Twelvemeatballs",
      "url": "https://www.reddit.com/r/ethereum/comments/1pbptyg/going_bankless_can_i_pay_with_this_part_five/",
      "published": 1764625431.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "This is Part Five of the eight-part series: Can I Pay With This: A stablecoin experiment in Buenos Aires. Thank you to the Ethereum Foundation and the EV Mavericks for their support, without which this experiment could never have happened. Part One: Decentralized or Destitute <-- New? Start here. Money, monkeys and mild terror Part Two: First Contact with Reality KYC on a hostel bunk bed Part Three: WE ACCEPT BITCOIN (sort of) Worst title for an Ethereum subreddit ever Part Four: Eighteen Ways to Pay for Ice Cream Stablecoins, FX hell and a missing keyboard Part Five: Going Bankless <-- You are here From tourist shop hack to cueva contact The problem is, if I want to transact freely here, without putting my trust into a random Web3 app created by strangers who need my KYC but don't need or want to share anything about themself, then I need cash. I find a touristy gift shop with stickers on their window showing dollar signs and pesos. Inside is a young man with a trendy haircut and flashy clothes. He looks hip. Maybe he'll be into the future of finance? He confirms that he's happy to exchange money for me but looks befuddled when I mention USDT, the stablecoin pegged to the US dollar most commonly used in Argentina. \"¿USD?\" \"No. USDT,\" I insist. I have no idea how to say stablecoins. \"Digital dolares?\" He corrects me, Dolares digitales, but it still sounds like there's a question mark at the end of that. \"Sí!\" He looks at me again. \"¿Y quieres cambiarlos?\" And you want to exchange them? I can't tell if he's confused by the concept or just thinks I don't look like the type to come walking into his shop talking about crypto. \"Sí,\" I say again. He's still not sure. \"¿Dolares virtuales?\" I blink. Virtual dollars sound like something you'd need for World of Warcraft. But maybe it's the better way to say it? \"Sí,\" I say again. I am aware that I'm really not keeping up my side of this conversation. He thinks for a moment. \"Tell you what,\" he says in Spanish. \"What I can do is charge your card, hand you cash, you pay a little extra.\" My first thought: isn't that illegal? But of course, so is all of this, trying to buy dollars without going through the official systems. \"How much is a little extra?\" He gives me a rate that is slightly cheaper than Western Union and we are in agreement. I tap my phone, he hands me cash. It feels slick, outside of the system, a benefit to both of us. I feel he understood my intent, even though he couldn't actually do the task. It's a cryptocard with USDT on it. Technically, I have just successfully exchanged stablecoins for cash. Deep down, though, I know it doesn't count. My phone pings: Pomelo has added me to Telegram. I immediately message back with a recap of how I am, because I'm used to my friendship circle who have the memory span of a fruit fly. I am pretty sure I'm not imagining his exasperated tone when he replies to say Yes, I know and I'm working on it. It's fine, I say breezily, I have weeks. No worries. What I really want is for him to say Here's an address. Go there now. Don't look back. before I lose my nerve. Argentina has had strict foreign exchange controls since late 2011 in an attempt to stop capital flight. By 2012, the government flat out banned buying dollars for savings. Restrictions escalated, with online shopping restricted to two parcels a year, $25 max. In 2014, the country defaulted on its debt again.The gap between the official rate and the blue rate was 90%, opening the door for the cuevas offering illicit money exchange. The stage was set for any viable alternative that could avoid government restrictions. Enter stablecoins: digital, virtual, and available to hold without having to trust the bank. In Argentina, and globally, if you're paying attention, trust in banks is gone. People don't hold stablecoins as a symbol of rebellion; it's a working alternate system. It might not be ideal, but it is usable. Pomelo sends me regular reassuring messages and I'm starting to feel like his aging aunt who needs handholding because otherwise she'll start on the gin and then all hell will break loose. That said, maybe gin isn't a bad idea. Finally, finally, a whole three hours later, he sends me a name. A contact who will sell me pesos at the blue rate. He says that his friend is expecting my message. I spend the rest of the evening staring at my phone like it might bite me. Finally, out of pure fear that I'll be one of those people who go to Argentina and write a memoir about almost using crypto, I pick up the phone. I message the Blue Man half in Spanish and half in English, not sure which language he will prefer. I'm searching for the perfect replacement for my pink keyboard when I receive a message from Blue Man in perfect English, confirming that Pomelo told him that I'm wanting to buy pesos, and how much? Suddenly, this isn't a thought experiment anymore. Someone on the other end of a screen is offering to hand me cash, in a city I barely know, in exchange for something that we can't touch. He sends me a link, today's rate. Tells me USDT only. I ask which chain. There's a pause. It sounds like a small thing, but it's not. I want this trade to happen in the context of Ethereum. Tether—USDT—is on nearly every chain now but in Argentina it's commonly used on TRON. Cheap fees, fast transfers, but the ecosystem around it feels like a second-hand suit: functional but a little grimy. I've already decided that if he won't do ERC-20 stablecoin transfer, I'm out. To my relief, Blue Man sends a screenshot from his wallet. Yes, TRON and SOL are at the top but also ERC-20 options: Ethereum mainnet, Arbitrum, Polygon. I stand in the street, phone in hand, trying to get USDT on Arbitrum and then I think, to hell with it. I already have $300 USDT sitting on mainnet, easier just to swap another $100 and eat the gas fees rather than keep chasing some hyperoptimized elegant solution that no one else cares about. Now that we are in technical agreement, Blue Man asks where I am so that he can bring me the cash. I tell him I'm wandering lost trying to find a shop that will sell me a USB keyboard that I don't hate with the passion of a thousand suns, but once I've done that, I'll meet him anywhere. Bonus points if there's coffee. I'm still staring at my phone when I bump into someone. The sidewalk is jammed with people, locals queuing up at a nondescript red doorway. No name, no music, just the smell of hot oil and a chalkboard with today's specials. I join them. When it's my turn to walk inside, I find I'm in a tiny room with chairs up against a thin table on one side and a counter on the other where multiple people are dishing out meals. Tucked in by the doorway is a creased-face old man running the till with practiced precision: cash, card, QR. I ask for lentils, one of the specials. \"We don't have lentils,\" he tells me. \"Oh.\" I have no Plan B. I stand there, lost, an anathema to his fast-moving system. \"We didn't make them,\" he tells me. \"It's too hot.\" \"But I like them,\" I say meekly, as if we are having a conversation. He glares at me. I lean to get view of the chalkboard and blurt out the only other thing that I can see. \"Albondigas con arroz.\" I do not understand why it is too hot for lentils and not too hot for meatballs with rice but no one else seems concerned. The man scribbles the price on a small piece of paper and hands it to me. I shove it in my pocket, grumpy that he doesn't trust me to understand the numbers. \"I'll pay by QR,\" I say, like I'm a local just masquerading like a lost tourist. He waves me to the counter, a narrow area crammed with hungry office workers and freelancers looking ready to make their next deal. The man behind the counter is moving fast, handing out plates of food. Then he barks for the next person to give him their order. With horror, I realise that I have to hand over the scribbled number on a slip: it wasn't for me, it was for this guy. I hand him my rumpled slip and ask for meatballs to eat here, perching on a high stool. A few minutes later, he slides a plate towards me, heaped with rice and three large meatballs. \"Albondigas para dos,\" he says. \"No, no.\" This is meatballs for two, and I'm only me, I say, confusedly. He pauses, his face creased with concern. What's wrong? Do I not wan this? I'm breaking the system again. \"Soy sola,\" I say, I'm alone, and then spot my mistake. I think I just informed the guy that I'm single. He holds my gaze. No one else claims the plate. And who the hell serves three meatballs for two people. Never mind, I tell him. It's fine. Don't worry. He frowns and then flies back into chaotic motion, taking orders, handing out the results. I'm halfway through my meal when I hear it again: his voice, handing a takeaway box to someone else. Para vos. For you. Singular. Direct. Only in Argentina. Even the simplest of interactions are fraught for me here. I pull out my phone to get my next instruction from Blue Man. His text says I don't need to come to him. Finish my shopping. He can send a motorbike courier to me. This is not what I expected. I thought that we would meet in some indoor back room. Some fluorescent-lit space with a counter and chairs and CCTV. And witnesses. I remember my hostel manager: never make transaction on the street. I ask him straight: I meet a guy on a motorbike who just... pays me? Yes, exactly. Once the funds hit the Blue Man's wallet, motorbike man will hand me the envelope. An envelope. Could be anything. Receipts. Cut-up newspapers. A polite threat. And how is motorbike man going to know that the money went through? I don't like any of this. I message back that I need to know the envelope actually has money in it. Before I do the transaction. I admit that I don't know how to do this in a trustless way. There is no problem, he tells me. His very good friend Pomelo recommended him to me, he reminds me. This is meant to represent trust. I message Pomelo: is he actually a very good friend? Would he trust him with cash? At the same time I message Blue Man again. Pomelo is not my good friend. He's just some guy I met in an ice cream shop. Somewhere between all this, I find a keyboard. It's not pink but it will do. I want to point out to Blue Man that I'm a woman alone, in a foreign city, explain why this setup is starting to feel physically dangerous. But he already knows that I'm a foreigner. Assumes I don't speak Spanish. My real name. He knows a hell of a lot more about me than I do about him. There really isn't anything I can add to that. A message from Pomelo. Yes, this is a real friend and yes, he'd trust him. They could be in this together, of course. But Pomelo is plugged into the local Ethereum scene. He has a reputation. Something to lose. Blue Man is waiting. I stall. Tell him that I'm looking for a place to meet the courier. \"As long as I can see the cash first,\" I text, \"we're good.\" I find a place to sit in the middle of the avenue, the Obelisk towering above me, and try to think this through. I've moved from my hostel room to a dingy hotel on the other side of the Avenida. Motorbike guy could meet me there. Not my room—god no—but in the lobby. The front desk is staffed by a guy who looks like personal protection, with arms the size of my thighs. If it goes sideways with motorbike guy, he might not take my side. He might not even look up. But it's indoors, big windows, a busy street. CCTV, probably. I don't care about my stuff. If the burner phone gets grabbed, it doesn't matter. The wallet is synched elsewhere. I have already learned where to buy a keyboard. What I need is at least a hint of physical protection. I am not actually able to put my trust into strangers with pseudonyms and cash in envelopes. I send Blue Man a screenshot of $400 in pesos pegged to the blue rate. It's up ten pesos since this morning. He offers a round number, asks if I want large bills or small. He's happy with the lobby. He's going to come personally, he tells me, so that I can feel more comfortable. This means that Blue Man will know where I'm staying, not just some guy on a motorbike. But at this point, I'm out of ideas. Another message from Blue Man. \"Can we do this now?\" I tell him I'll be there in twenty. Up next is Part Six: Trustless, My Ass (Trading with the Blue Man) I have some personal issues going on, so we're taking a brief break. I'll be back with Part Six toward the end of the week."
    },
    {
      "title": "Daily General Discussion December 01, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1pb54eb/daily_general_discussion_december_01_2025/",
      "published": 1764568945.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    }
  ],
  "fetched_at": "2025-12-03T13:21:03.262056+00:00"
}