{
  "subreddit": "ethereum",
  "posts": [
    {
      "title": "Daily General Discussion December 06, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1pfhy31/daily_general_discussion_december_06_2025/",
      "published": 1765000851.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "Revising ERC-2535 Diamonds to Simplify and Improve the Terminology",
      "author": "mudgen",
      "url": "https://www.reddit.com/r/ethereum/comments/1pfgiab/revising_erc2535_diamonds_to_simplify_and_improve/",
      "published": 1764996061.0,
      "thumbnail": "https://external-preview.redd.it/pLYfQIFvue7Tig0Wx7mJmq_5XPfVkCsh5yrMvFmtATg.png?width=640&crop=smart&auto=webp&s=5fdbed10272c86384eb3ec8425b98b076d3acbbf",
      "external_url": "https://ethereum-magicians.org/t/revising-erc-2535-diamonds-to-simplify-and-improve-the-terminology/26973",
      "site_name": "Fellowship of Ethereum Magicians",
      "favicon": "https://ethereum-magicians.org/uploads/default/optimized/2X/3/3a633db8b362151a5dd196670cef12dc5deafc05_2_180x180.png",
      "description": "My post on X about it is here: https://x.com/mudgen/status/1997162259986973052"
    },
    {
      "title": "Odysee has integrated Wander Connect for the CLabs team for the Arweave ecosystem.",
      "author": "jharmomy",
      "url": "https://www.reddit.com/r/ethereum/comments/1pfiq9r/odysee_has_integrated_wander_connect_for_the/",
      "published": 1765003681.0,
      "thumbnail": null,
      "external_url": "https://help.odysee.tv/category-monetization/wander/",
      "site_name": "help.odysee.tv",
      "favicon": "https://help.odysee.tv/img/favicon-spaceman.png",
      "description": "How to install the Wander Wallet browser extension?"
    },
    {
      "title": "Part Six of \"Can I Pay With This?\": Trustless, My Ass",
      "author": "Twelvemeatballs",
      "url": "https://www.reddit.com/r/ethereum/comments/1pf4r51/part_six_of_can_i_pay_with_this_trustless_my_ass/",
      "published": 1764964112.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "This is Part Six of the eight-part series: Can I Pay With This: A stablecoin experiment in Buenos Aires. Thank you to the Ethereum Foundation and the EV Mavericks for their support, without which this experiment could never have happened. Table of Contents Part One: Decentralized or Destitute <-- New? Start here. Money, monkeys and mild terror Part Two: First Contact with Reality KYC on a hostel bunk bed Part Three: WE ACCEPT BITCOIN (sort of) Worst title for an Ethereum subreddit ever Part Four: Eighteen Ways to Pay for Ice Cream Stablecoins, FX hell and a missing keyboard Part Five: Going Bankless From tourist shop hack to cueva contact Trustless, My Ass <-- You are here Trading with the Blue Man At the hotel, the man working reception is exactly who I was hoping for: tall, broad, the build of someone who could win a bar fight just by standing up. When I sit down in the lobby, he asks if I'm meeting someone, like I need permission to sit in the hotel that I'm paying for. I say yes I am. Meeting someone. He waits, in case I'll give further details, and then shrugs and leaves me alone. One more message to Blue Man. I'm here. Look for the blonde sitting by the window. I wait. Half an hour passes. I look up nervously every time someone walks in. I set up my new keyboard to have something to do with my hands. Reception man keeps one eye on me but most of his attention is taken up by the endless stream of tourists dragging too many bags. A pick-up truck pulls up outside. My stomach flips. Is this him? Is this how it's going to happen? Am I supposed to go out there? Is he just going to hand me an envelope after all. Am I supposed to get in the truck? I stay exactly where I am, mentally drafting excuses for not going outside. Anything that doesn't make me sound like a person whose first reaction to a pick-up truck is potential kidnapping. The truck pulls away. Nothing to do with me. A large French family arrives and explodes across the lobby, checking in to their rooms to drop luggage and then meeting again to go out on the town. Couples, children, cousins, an elderly woman with cataracts calling out \"Who are we missing,\" every few minutes. How the hell am I going to enact a dodgy transaction with Grandmère sitting next to me? Eventually, the lobby clears and it is just me and the muscled man at reception. Blue Man messages, apologizes, he's finally on his way. A businessman walks in wearing a sharp suit and a tired face, checks into a room and heads for the elevator. Skinny guy wearing headphones drops a package on the desk, disappears without a word. A man with a nose that's been broken many times walks in and looks around. I tense. Muscle man behind the counter greets him like an old friend. A kid walks in, looks about thirteen. I slump back into my seat. He turns, scans the room, sees me. His face lights up. He says my name. This is Blue. He is not thirteen, of course. Just young and slender. He looks like a gentle soul. Maybe writes poetry. If it came to it, I could body slam him and run. I stand. We kiss cheeks. I invite him to join me on the corner of the sofa that has been my home for the past hour. He tells me, a little nervously, that his English is not very good. I'm charmed. He holds out an envelope. I peek inside. Yes, it looks like money. \"Count it,\" he says. I pull out the bills and count them quickly. Reception man watches us, flexing, trying to work out if I'm selling my services in his hotel. Possibly I haven't thought this through. I count faster. The amount is correct. I place the envelope next to him and set up the transaction on my phone. He pulls out his phone and shows me his list of chains, asks me again what I've chosen. I get his wallet address and send the USDT. I show him the confirmation. Blue stares at his screen. \"It takes a moment,\" he says. It shouldn't. But I wait. A minute passes, then two. A cold feeling is just starting to creep up my spine when he makes a happy sound, shows me a Bybit notification that someone has sent him 400 USDT. Blue's using a centralized exchange. It's none of my business. The transaction is complete. I pick up the envelope. He tells me that I can message him anytime, if I need anything. That he would be happy to do this again. I hope reception man isn't listening. Then he notices my keyboard on the table. \"Is this what you bought?\" I nod and he laughs, like who goes all the way to Buenos Aires to buy a keyboard? \"Mine was stolen,\" I say. He gives me another dubious look and picks it up. His face brightens into a smile. \"Oh! It's so light!\" I'm absurdly pleased that he likes my keyboard. We say our goodbyes under the steely gaze of reception man. And then Blue is gone. Still to come: Custodial Services (Self-custody is easy, luggage custody is hard) Apparently I Did It Wrong (\"You should have just used X, bro.\")"
    },
    {
      "title": "The wait is over! 🎥 All talks from the #EIPSummit at Devconnect Argentina are now live on the ECH Institute YouTube channel. 🇦🇷✨ From gas repricing to AI data standards, this is your masterclass on how Ethereum evolves. A thread of all sessions 👇🧵",
      "author": "AkashKshirsagar",
      "url": "https://www.reddit.com/r/ethereum/comments/1pfgpdd/the_wait_is_over_all_talks_from_the_eipsummit_at/",
      "published": 1764996712.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "1️⃣ From Research to Reality – An EIP’s Journey with Pooja Ranjan The summit kicks off by bridging the gap between abstract research and deployed code. A must-watch for understanding the EIP Process. 📺 Watch it here: https://youtu.be/wH76j1BDZkc #Ethereum #EIP #EthereumGovernance #EthCommunity 2️⃣ Don’t just use Ethereum: help shape it! with Jochem Brouwer Jochem argues that providing feedback on EIP drafts is a civic duty. Silence leads to consensus bugs. Learn how to break the silence on the Magicians forum. 📺 Watch it here: https://youtu.be/ZVHHsKS6Kxo #Ethereum #EIPSummit #EIPs 3️⃣ From Draft to Inclusion: A Proposal’s Journey with Jihoon Song Writing the EIP is only 5% of the work. The hard part is convincing people to consider it. Jihoon shows how to talk to the right people and handle the Core Dev meetings to get your idea accepted. 📺 Watch it here: https://youtu.be/i8HO-bAivno #EIPSummit #EIPs #EIPProcess #CoreDev 4️⃣ From Specification to Syncing a Node: Ensuring Upgrade Readiness with Parithosh Jayanthi How do you test a $500B+ network without breaking it? Inside the industrial supply chain of Ethereum testing: from Hive unit tests to mainnet Shadow Forks. 🏗️ 📺 Watch it here : https://youtu.be/9yTrzNCd0Gk #Testing #Devnets #ShadowForks 5️⃣ Code is Law: Avoiding Spec-ulation for Faster Forks with danceratopz & raxhvl The propose accelerating Ethereum forks by tightly coupling EIP markdown with executable specs, ensuring every text change is instantly verified by code to eliminate ambiguity. 📺 Watch: https://youtu.be/h5sUMWD9Yus #Ethereum #SpecReview #Testing 6️⃣ EIP-8007: A major update to EVM gas prices with Maria Inês Silva A quick explainer on why Meta EIP listing all related EIPs matters. How authors propose to reshapes gas pricing, and what this means for developers, performance & future upgrades. 📺 Watch: https://youtu.be/HpRNP8tc0lY #EIP8007 #EVM #GasCosts #GasPricing 7️⃣ From Idea to EIP: A First-Time Author’s Journey with German Abal How a first-time contributor turns an idea into a real EIP - from drafting to reviews, feedback loops, and working with editors. 📺 Watch here: https://youtu.be/WcGYlzUChUE #EIPEditors #EthGovernance #EthereumStandards 8️⃣ ERCs in Focus - ERC-8028: AI Assets On-Chain with Thiru The video explains how ERC-8028 anchors AI data on-chain using DAT, enabling trust, provenance, and verifiable AI workflows. A simple breakdown of why this ERC matters for the future of AI + Ethereum standards. 📺 Watch: https://youtu.be/RaeBZiE0rDA #ERC8028 #ERCs #AIonChain #DAT 9️⃣ Meet EIP Editor Sam Wilson He breaks down what EIP editors do, how proposals are reviewed, and how Ethereum standards keep evolving. 📺 Watch: https://youtu.be/YHZviU19di0 #EIPEditors #EIPProcess #EthereumStandards 🔟 The Final Episode - ERC-1202: Voting Interface with Victor Zhou See how ERC-1202 enables flexible, on-chain voting mechanisms for DAOs & governance tools. A clean walkthrough of the standard, design choices, and real-world use cases. 📺 Watch: https://youtu.be/_szGTp49L5E #ERC1202 #OnChainVoting #GovernanceTech The EIP Summit was more than just talks; it was a call to action. Ethereum needs authors, reviewers, and testers. Special thanks to all speakers and the ECH Institute team! 😸 #Ethereum #Devconnect #EIPs #Web3"
    },
    {
      "title": "Daily General Discussion December 05, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1penica/daily_general_discussion_december_05_2025/",
      "published": 1764914472.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "Trump Family’s Crypto Empire Collapses: Nearly $1 Billion Wiped Out as World Liberty and Memecoins Crash",
      "author": "shadrack_CK",
      "url": "https://www.reddit.com/r/ethereum/comments/1pe06ir/trump_familys_crypto_empire_collapses_nearly_1/",
      "published": 1764855388.0,
      "thumbnail": "https://external-preview.redd.it/_d8gHOZZJgORyIb0nJddwObrhDilPHbkHJO1sj3AD28.jpeg?width=640&crop=smart&auto=webp&s=3b0f309c71d656a6e8832924d0a64d458dc101f1",
      "external_url": "https://dailyglitch.com/trump-familys-crypto-empire-collapses-what-really-went-wrong-with-world-liberty-and-memecoins/",
      "site_name": "𝐓𝐇𝐄 𝐃𝐀𝐈𝐋𝐘 𝐆𝐋𝐈𝐓𝐂𝐇",
      "favicon": "https://dailyglitch.com/wp-content/uploads/2025/08/site-icon.png",
      "description": "Trump crypto empire falls faster than bitcoin"
    },
    {
      "title": "Here's the full tech stack including ethereum rollups deployment platform we use to run our blockchain game with 10k players",
      "author": "eren_yeager04",
      "url": "https://www.reddit.com/r/ethereum/comments/1peu4wz/heres_the_full_tech_stack_including_ethereum/",
      "published": 1764938692.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "saw some questions about production web3 gaming setups so figured i'd share our full stack, we run a multiplayer game with about 10k active players. frontend: unity for game client, react for web dashboard smart contracts: solidity, hardhat for development, foundry for testing infrastructure: caldera for rollup deployment, alchemy for backup rpc calls, the graph for indexing monitoring: tenderly for transaction monitoring, sentry for error tracking deployment: github actions for ci/cd, vercel for web hosting analytics: mixpanel for user analytics, dune for on chain analytics The infrastructure piece was the biggest decision, we initially tried deploying our own rollup but it was a nightmare, switched to managed solution and shipped way faster. deployment was straightforward and support has been solid when we needed it. The biggest cost is actually alchemy for backup rpc even though we have our own nodes, turns out redundancy is worth it when you have paying users. whole stack runs about $800-1000 per month. We use both hardhat and foundry because hardhat for deployment scripts and foundry for testing since its way faster. mostly standard ethereum tools, game specific stuff is all in unity not on chain. Im happy to answer questions about any of these choices or tradeoffs we made."
    },
    {
      "title": "Ethereal news weekly #1 | 🦓 Fusaka upgrade live on mainnet ⚠️ Client diversity: Lighthouse 55% 🎂 Beacon chain 5th anniversary",
      "author": "abcoathup",
      "url": "https://www.reddit.com/r/ethereum/comments/1pesttx/ethereal_news_weekly_1_fusaka_upgrade_live_on/",
      "published": 1764934574.0,
      "thumbnail": "https://external-preview.redd.it/2zyY6e5Mf5R63ELydbdrYjrz_yIBJn5i9-GpP66kmzM.jpeg?width=640&crop=smart&auto=webp&s=5a0bcc467e92ab01c45c72e2085e5e0169e799e6",
      "external_url": "https://ethereal.news/ethereal-news-weekly-1/",
      "site_name": "ethereal.news",
      "favicon": "https://ethereal.news/favicon.svg",
      "description": "Fusaka upgrade live on mainnet, client diversity: Lighthouse 55%, Beacon chain 5th anniversary"
    },
    {
      "title": "Highlights from the All Core Developers Execution (ACDE) Call #225",
      "author": "Y_K_C_",
      "url": "https://www.reddit.com/r/ethereum/comments/1pego5o/highlights_from_the_all_core_developers_execution/",
      "published": 1764894384.0,
      "thumbnail": "https://external-preview.redd.it/K1RcM0LAadD7-6wwPZdTDKsNMd1iU6IoBFkKvn3bc54.png?width=640&crop=smart&auto=webp&s=539183c7c9064c060e9a9f3e9986f6338b07c25e",
      "external_url": "https://etherworld.co/2025/12/04/highlights-from-the-all-core-developers-execution-acde-call-225/",
      "site_name": "EtherWorld.co",
      "favicon": "https://etherworld.co/content/images/size/w256h256/2023/03/new-logo--3--2.png",
      "description": "A comprehensive breakdown of ACDE #225 detailing Fusaka incident analysis, Glamsterdam scoping decisions, FOCIL process debates, and the roadmap toward the Heka upgrade."
    }
  ],
  "fetched_at": "2025-12-06T09:58:42.976980+00:00"
}