{
  "subreddit": "ethereum",
  "posts": [
    {
      "title": "Trump Family’s Crypto Empire Collapses: Nearly $1 Billion Wiped Out as World Liberty and Memecoins Crash",
      "author": "shadrack_CK",
      "url": "https://www.reddit.com/r/ethereum/comments/1pe06ir/trump_familys_crypto_empire_collapses_nearly_1/",
      "published": 1764855388.0,
      "thumbnail": "https://external-preview.redd.it/_d8gHOZZJgORyIb0nJddwObrhDilPHbkHJO1sj3AD28.jpeg?width=640&crop=smart&auto=webp&s=3b0f309c71d656a6e8832924d0a64d458dc101f1",
      "external_url": "https://dailyglitch.com/trump-familys-crypto-empire-collapses-what-really-went-wrong-with-world-liberty-and-memecoins/",
      "site_name": "𝐓𝐇𝐄 𝐃𝐀𝐈𝐋𝐘 𝐆𝐋𝐈𝐓𝐂𝐇",
      "favicon": "https://dailyglitch.com/wp-content/uploads/2025/08/site-icon.png",
      "description": "Trump crypto empire falls faster than bitcoin"
    },
    {
      "title": "Daily General Discussion December 04, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1pdse8b/daily_general_discussion_december_04_2025/",
      "published": 1764828048.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "Sony launches Stablecoin! 🎮 USDSC lists on Ethereum L2!",
      "author": "renkure",
      "url": "https://www.reddit.com/r/ethereum/comments/1pdxj1w/sony_launches_stablecoin_usdsc_lists_on_ethereum/",
      "published": 1764847299.0,
      "thumbnail": null,
      "external_url": "https://ecency.com/@pichat/sony-launches-stablecoin-usdsc-lists-on-ethereum-l2-9sh",
      "site_name": "ecency.com",
      "favicon": null,
      "description": null
    },
    {
      "title": "Fusaka Infographic 🦓 13 EIPs, one massive ethereum upgrade!",
      "author": "trent_vanepps",
      "url": "https://www.reddit.com/r/ethereum/comments/1pdfavo/fusaka_infographic_13_eips_one_massive_ethereum/",
      "published": 1764793245.0,
      "thumbnail": "https://preview.redd.it/jccnmgz6s15g1.png?width=640&crop=smart&auto=webp&s=4eb8835504ddebb4a0f6a8605a86b71b32c6b616",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "a wonderful fusaka day to you all - original post if you want to help boost on twitter!"
    },
    {
      "title": "How is Ethereum solving the blockchain trilemma? Post Fusaka upgrade analysis.",
      "author": "Worldly-Law9012",
      "url": "https://www.reddit.com/r/ethereum/comments/1pdra4c/how_is_ethereum_solving_the_blockchain_trilemma/",
      "published": 1764824506.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Ethereum is actively working to address the blockchain trilemma, a core challenge in the design of decentralized systems that suggests a blockchain can only achieve two of three key properties—Decentralization, Security, and Scalability—at the same time. Ethereum's strategy involves a multi-phased roadmap and the heavy utilization of Layer 2 (L2) scaling solutions to tackle scalability while maintaining its core commitments to decentralization and security. 🛡️ Security and Decentralization Ethereum's foundational layer, or Layer 1 (L1), prioritizes security and decentralization, which are fundamental to its value proposition as a \"world computer.\" Security: The network transitioned from a Proof-of-Work (PoW) consensus mechanism to Proof-of-Stake (PoS), known as The Merge (September 2022). PoS maintains a high level of security by making it prohibitively expensive for a malicious actor to gain enough staked ETH to compromise the network. The economic cost of an attack on Ethereum's PoS network is arguably higher than on its former PoW network. Decentralization: PoS is intended to boost decentralization in the long run by making it easier for more people to become validators, as it requires less specialized, expensive hardware compared to PoW mining. The development roadmap also includes phases like The Scourge and The Purge, which aim to further improve censorship resistance and reduce the hardware requirements for running a node, promoting wider network participation. 🚀 Scaling (Solving the Trilemma's Third Side) Ethereum's main challenge was scalability—the network became congested, leading to slow transactions and high gas fees. The strategy to address this is primarily through Layer 2 solutions and fundamental L1 upgrades. Layer 2 (L2) Scaling Solutions Ethereum leans heavily on L2 networks, which process transactions off the main chain but settle on L1, inheriting Ethereum's robust security. Rollups: These are the most prominent L2 solution. They execute thousands of transactions off-chain and then bundle (\"roll up\") the resulting data into a single, compressed transaction that gets submitted back to the Ethereum Mainnet. Optimistic Rollups (e.g., Arbitrum, Optimism): Assume transactions are valid but allow a \"challenge period\" where anyone can submit a fraud proof if they detect an invalid transaction. Zero-Knowledge (ZK) Rollups (e.g., zkSync, Starknet): Use cryptographic proofs (validity proofs) to instantly verify the correctness of off-chain transactions, providing stronger security guarantees. By offloading the execution layer to L2s, Ethereum L1 can focus on its role as the secure and decentralized data availability layer. Layer 1 Upgrades Ethereum's roadmap includes major L1 upgrades to support the L2 scaling strategy: Proto-Danksharding (EIP-4844): Implemented in the Dencun upgrade (March 2024), this introduced a new, cheaper way for rollups to post transaction data to the L1 using \"blobs\". This significantly lowered L2 transaction costs, boosting scalability without compromising security or decentralization. The Surge (Full Sharding): The long-term vision involves a form of data sharding where the network is split to handle data more efficiently. This will dramatically increase the data capacity of the L1, further scaling the L2 ecosystem to potentially handle hundreds of thousands of transactions per second (TPS). In essence, Ethereum is solving the trilemma by adopting a layered approach: L1 provides decentralized security, and L2s provide scalability."
    },
    {
      "title": "Daily General Discussion December 03, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1pcwf5g/daily_general_discussion_december_03_2025/",
      "published": 1764741636.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "Protocol Guild | Q4 2025 Membership Audit",
      "author": "PeterAugur",
      "url": "https://www.reddit.com/r/ethereum/comments/1pdgmut/protocol_guild_q4_2025_membership_audit/",
      "published": 1764796288.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Our membership has concluded its latest quarterly audit of funded members as of Nov 19 2025. This 14th consecutive update reaffirms our institution’s consistency and ability to self-regulate. The member registry now includes a number of new contributor accounts as well as new alumni, and weight changes; creating a representative body of the developers and maintainers who work on client implementations, research, and upgrade delivery. Protocol Guild’s membership is now 184, with a net increase of 8 (+4.5%) members from 176 of last quarter. This quarter, the membership update was processed onchain via Protocol Guild’s new Agora-based DAO contracts. Readers will find a comprehensive list of the changeset below. Working Groups Added: zkEVM Working Group #400 Read more at blog post here Removed: Portal Working Group #423 New Members (23 total) Working Group New Members Lighthouse Josh King #420 Prysm Bastin #416, Chris Karabats #429 zkEVM Thomas Coratger #444, Cody #440, Sophia #439, TingHan Jian #438 P2P Raúl Kripalani #428, Marco Munizaga #425 Reth Roman Hodulák #426 Nethermind Marcos Maceo (part-time) #422, Maksim Menshikov #410 Testing Carson #390, Felix Hoffmann #406 Specs & Coordination Marc Garreau #408, Nixo #407 Statelessness Wei Han Ng #404, Carlos Perez #401 Mechanism Design Maria Silva #399 Security Antoine James #395, Yassine Ferhane #397 Prototyping Jihoon Song #392 New Alumni Members (14 Total) Protocol Guild members who move on to other work are considered ‘Alumni’ at the conclusion of their membership. We are grateful for their stewarding contributions to the world computer over the years and wish them well. Working Group New Alumni Architecture Dankrad #446 Lighthouse Paul Hauner #419, Mehdi #418, Adrian #417 Prysm Taran #445, Raul Jordan #412 Portal Piper #423 Reth Roman Krasiuk #402 Cryptography Mark Simkin #441 Prototyping shemnon #393 Mechanism Design Davide Crapis #398 EthereumJS am1r021 #437 DAS Dmitriy Ryajov #414, Leonardo Bautista-Gomez #405 Weight & Status Changes (9 Total) Change Type Updates Weight Increases Shoham Chakraborty (Erigon): 0.5 → 1 #433, Marc Holt (Erigon): 0.5 → 1 #432, Marc Harvey-Hill (Nethermind): 0.5 → 1 #421, Artiom: 0.5 → 1 #403 Weight Decreases Federico Gimenez: 1 → 0.5 #430, Alexey Shekhirin: 1 → 0.5 #427, Ayman Bouchareb: 1 → 0.5 #394, Damian Orzechowski: 1 → 0.5 #409, Scottypoi: 1 → 0.5 #431 Affiliation Updates Moved Paweł Bylica to Erigon #389 The next audit will begin in January 2026 and should be fully reflected in our active membership by mid-February."
    },
    {
      "title": "EIP-7918 in Fusaka: 3 reasons and 1 trick",
      "author": "AElowsson",
      "url": "https://www.reddit.com/r/ethereum/comments/1pd22ch/eip7918_in_fusaka_3_reasons_and_1_trick/",
      "published": 1764762452.0,
      "thumbnail": "https://external-preview.redd.it/IowdQowt3HjVc2_v7hjaoxOtWACbeO7t7eNBcXnNun0.jpeg?width=640&crop=smart&auto=webp&s=52a3a1ec89b6aac1fc5fa96fbc775c1141dc660d",
      "external_url": "https://notes.ethereum.org/@anderselowsson/EIP-7918-3-reasons-1-trick",
      "site_name": "HackMD",
      "favicon": "https://notes.ethereum.org/apple-touch-icon.png",
      "description": "# EIP-7918 in Fusaka: 3 reasons and 1 trick  Tonight, Fusaka goes live and Ethereum updates its blob"
    },
    {
      "title": "Exclusive Look Inside a Compromised North Korean APT Machine Linked to The Biggest Heist in History",
      "author": "Malwarebeasts",
      "url": "https://www.reddit.com/r/ethereum/comments/1pd49bo/exclusive_look_inside_a_compromised_north_korean/",
      "published": 1764768782.0,
      "thumbnail": "https://external-preview.redd.it/Zyv5xLAnliqLcCyJOvBBBgrFFxh8yUbyLSh7_wRfszw.png?width=640&crop=smart&auto=webp&s=d05fa89fa6bb25cee8e0c18fe028e700f9275df2",
      "external_url": "https://www.infostealers.com/article/exclusive-look-inside-a-compromised-north-korean-apt-machine-linked-to-the-biggest-heist-in-history/",
      "site_name": "InfoStealers",
      "favicon": "https://www.infostealers.com/wp-content/uploads/2023/08/favicon-300x300.png",
      "description": "Recently, Hudson Rock analyzed a unique infection from a LummaC2 infostealer log. The victim wasn't a corporate employee or an unsuspecting consumer. The victim was a high-level threat actor operating a sophisticated malware development rig."
    },
    {
      "title": "Is this approach used in \"sharding\" or a good idea?",
      "author": "johanngr",
      "url": "https://www.reddit.com/r/ethereum/comments/1pd6oau/is_this_approach_used_in_sharding_or_a_good_idea/",
      "published": 1764774459.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "It has seemed to me \"sharding\" often tends to split the consensus mechanism. The technicalities of it seem well thought out but not the consensus part. It seems like it often uses something like randomly delegating from the validator pool but this (even if random) splits the consensus. Another approach is to not split the consensus. Add an intermediary level, a \"validator manager\", and make this what is voted for with coin-vote (or people-vote). This \"validator manager\" (or maybe it could even be called \"government\") then delegates one block producer per shard. That way, each shard has the same majority consensus as any other. The \"threads\" of a sharded blockchain have the same consensus as a single-threaded blockchain would."
    }
  ],
  "fetched_at": "2025-12-04T14:32:02.087218+00:00"
}