{
  "subreddit": "ethereum",
  "posts": [
    {
      "title": "Daily General Discussion December 01, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1pb54eb/daily_general_discussion_december_01_2025/",
      "published": 1764568945.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "Introducing Solidity Modules: How to Build Smart Contract Systems Without Inheritance or Solidity Libraries",
      "author": "mudgen",
      "url": "https://www.reddit.com/r/ethereum/comments/1pbgedl/introducing_solidity_modules_how_to_build_smart/",
      "published": 1764604532.0,
      "thumbnail": null,
      "external_url": "https://x.com/mudgen/status/1995513333139513796",
      "site_name": "X (formerly Twitter)",
      "favicon": "https://abs.twimg.com/responsive-web/client-web/icon-ios.77d25eba.png",
      "description": null
    },
    {
      "title": "Yearn Finance Exploited for Over $3 Million Worth of Assets",
      "author": "iffattalll",
      "url": "https://www.reddit.com/r/ethereum/comments/1pb39dn/yearn_finance_exploited_for_over_3_million_worth/",
      "published": 1764563061.0,
      "thumbnail": null,
      "external_url": "https://medium.com/@wzrqjs/yearn-finance-exploit-analysis-c0e89979672a",
      "site_name": "medium.com",
      "favicon": null,
      "description": "The Yearn Finance yETH vault was exploited for over $3 million. The attacker leveraged a dust attack combined with a flash loan to destabilize the underlying pool. In this case, the locus of the root cause was a flawed mathematical singularity in the _calc_supplyfunction that implemented the Newton-Raphson solver. The attacker submitted dust or small amount of liqudity into the skewed pool, causing the _calc_supplyfunction to diverge which forced the contract to incorrectly calculate the pool’s value as infinite. As a result, the attacker was able to practically mint millions of dollars worth of liquidity share for a bare-minimum cost."
    },
    {
      "title": "What’s the hardest bug you’ve ever had to track down in a Solidity project?",
      "author": "SolidityScan",
      "url": "https://www.reddit.com/r/ethereum/comments/1pbjn9d/whats_the_hardest_bug_youve_ever_had_to_track/",
      "published": 1764611682.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "We’ve all run into at least one Solidity bug that took way longer than it should’ve. Sometimes it’s a storage layout issue, sometimes it’s proxies behaving weirdly, an inheritance quirk, calldata alignment, math edge cases, or a subtle security assumption that only shows up under certain conditions. Curious to hear from other devs what’s the toughest or most confusing bug you’ve had to debug in a smart contract, and how did you finally track it down?"
    },
    {
      "title": "Running my first trading war and am giving away some eth as top prize. This is a game I've been developing and am basically willing to pay for players!",
      "author": "hupcapstudios",
      "url": "https://www.reddit.com/r/ethereum/comments/1pbhd31/running_my_first_trading_war_and_am_giving_away/",
      "published": 1764606665.0,
      "thumbnail": "https://external-preview.redd.it/g_s5_-SszdKQAKOe0s1pC8oudkgYJxkg7UEY-c5IJUA.png?width=320&crop=smart&auto=webp&s=9b2ef8d2e3b129f0e1c6f5e3688b7b997bc2a5e8",
      "external_url": "https://eth.botwars-c.com/game_room",
      "site_name": "BotWars-C",
      "favicon": "https://eth.botwars-c.com/apple-touch-icon.png",
      "description": "Build, train, and compete with trading bots in simulated crypto markets. Climb the leaderboard, win credits, and redeem for ETH."
    },
    {
      "title": "How RWA tokens(ERC3643) pegged with their underlying asset?",
      "author": "avik_saikat007",
      "url": "https://www.reddit.com/r/ethereum/comments/1pb77sj/how_rwa_tokenserc3643_pegged_with_their/",
      "published": 1764576545.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "I have the following questions regarding ERC3643 tokens, widely known as RWAs: Say for NVDAonThe asset value is determined from the NVDA stock, right? But how is the value of the NVDAon token changing on non-trading days(Weekends & holidays)? Can the value of the NVDAon(the RWA) Becomes zero if all of the holders withdraw their holdings, just like any standard ERC-20 token? If the value of the ERC3643 token is pegged with the underlying asset, then how are they different from each other, but with this much larger margin? ( As of 1.12.2025, NVDAon is 174.80 & NVDA is 176.98). This means their value is being determined based on their traded value?"
    },
    {
      "title": "Part Four of Can I Pay With This?: Eighteen Ways to Pay for Ice Cream",
      "author": "Twelvemeatballs",
      "url": "https://www.reddit.com/r/ethereum/comments/1patml2/part_four_of_can_i_pay_with_this_eighteen_ways_to/",
      "published": 1764537125.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "This is Part Four of the eight-part series: Can I Pay With This: A stablecoin experiment in Buenos Aires. Thank you to the Ethereum Foundation and the EV Mavericks for their support, without which this experiment could never have happened. Catch up here: Part One: Decentralized or Destitute Money, monkeys and mild terror Part Two: First Contact with Reality KYC on a hostel bunk bed Part Three: WE ACCEPT BITCOIN (sort of) OK, that was the worst title for an Ethereum subreddit ever Part Four: Eighteen Ways to Pay for Ice Cream <-- You are here Stablecoins, FX hell and a missing keyboard --- My first real encounter with hyperinflation comes with breakfast. I've been frequenting a bakery on Avenida de Mayo for their breakfast combo: A cup of coffee with two tiny croissant-like things stuffed with ham and cheese. Last week, the price was 6,000 pesos. This week, it's 8,200. I realize with a start that nowhere in this city have I seen a printed price. They are all on chalkboards or handwritten with ballpoint pen on menus that have been updated several times already. No one but me expects things to cost the same this week as they did last week. I'm converting small amounts of money every time to motivate me to try harder to find a way to get cash for stablecoins. The actual result is that I keep running out of cash. I've been told not to use ATMs as they charge an exorbitant fee but I'm willing to pay a fee in this case, or at least find out what it is. I find a bank with an ATM which seems like the most likely bet and tap my card. It's accepted and I have a few options for withdrawing cash, from 10,000 pesos to 50,000 pesos. That's not a lot. I tap 50,000 pesos. An error. That is over my daily limit. I back up and check my bank. Nope. Nowhere near my daily limit. This is a limit from the cash machine, not from my side. I go back to the machine and work my way down the list. 50, 40, 30. Finally, it agrees that I may have 30,000 pesos, about twenty dollars, but only if I pay a $7 transaction fee. I politely decline. Obnoxiously, the charge shows up as pending on my card despite my backing out: the funds are released the following day. I have learned my lesson about ATMs. Binance and Bybit advertisements are posted all over the city, bold and bright like emergency exits. These are centralized exchanges, the easy way to hold crypto. Instead of having a crypto wallet, the exchanges hold your funds for you. It's centralized, permissioned, requires full trust in the exchange to do right by you and to continue existing. Trading trust in banks for loosely regulated financial institutions. In Argentina, this is not necessarily a bad decision. Over my coffee, I scan for crypto news. El Submarino Jujuy, a provincial news site, has a long detailed piece on how to monitor five simultaneous exchange rates: official, blue, MEP, CCL and crypto dollars. What surprises me is how little explanation there is. The article assumes that the reader already has an exchange account, already holds ETH and BTC. There's no explanation of wallets or blockchains, only strategy. I cannot imagine an article like this in The Guardian or The New York Times, unless it had a sidebar on \"The mythology of crypto\" and a quote from a distressed 60-something who lost everything. And yet, while we are excited about smart contracts, leverage and liquidity protocols, most people here don't seem to be talking about trading. They're holding stablecoins, not for yield, not for innovation, but simply to avoid erosion. They are content to use centralized exchange cards, converting at checkout, side-stepping the crumbling peso. I do it too. Tapping my cards and scanning my QR apps for as many transactions as possible so I can limit my exposure to the peso. \"May I?\" An old man wants the other half of my table. He looks me over. \"Where are you from?\" I tell him. He nods knowingly and then asks, \"Is that Occidental or Oriental?\" This is not a question that I was expecting. \"Occidental, I think?\" He nods again, as if he knew that all along. When I go back to my phone, I get a lucky break—an event posted to Twitter: Stablecoin Ice Cream. A challenge to meet at Crecimiento to descend on the best heladería in Buenos Aires. \"Let's buy some ice cream using ONLY stablecoins.\" I sign up immediately. There are prizes for the best and worst FX rate. More people add more prizes, including 1000% cashback for using WalletConnect to pay for your ice cream The organizer thought probably no one would come. In the end, eighteen of us show up and he's slightly panicked that he didn't warn the ice cream shop. The server does his best to cope with a slightly feral crowd of crypto enthusiasts descending on him on a Friday afternoon. Someone convinces him to install a Settle wallet so that they can transact in USDC for the ice cream. It almost works until the owner intervenes and insists: pesos only. We each choose two scoops of ice cream. I get spicy mango and pistachio, which turns out to be an inspired combination. I scan the QR code to pay with Peanut. It fails. I switch to my trusty crypto card, which works. Someone else tries to scan the QR code with their Metamask wallet app, which doesn't. We test Peanut (which works for everyone else), Gnosis Pay, Yodl, Ready (Starknet), Redot. Quite a few give up and pay in cash. The organizer posts an update on Twitter: 50% of participants who are actually working in 9-5 jobs in web3 today couldn't pay with stablecoin on-chain. The FX rate varies by application but also by when the ice cream as bought, with noticeable volatility even on the same wallets over the half hour we took to order. I win a prize for the third-worst FX rate: 25 $BOND tokens. Now I have to find out what $BOND is. No one claims the 1000% cash back for using WalletConnect. No one can work out how. But it's a success. I have another two apps to try. A third, Luca, is tackling exactly the problem that I was thinking about: onboarding regular people to deposit their savings in stablecoins to gain yield from DeFi, with no need to understand any of the machinery. I explain about trying to use crypto in Buenos Aires, that I've still not seen any way to buy pesos with stablecoins. \"Why do you want to?\" I have DeFi cards. I have an app that scans QR codes. I can pay seamlessly in restaurants and ice cream shops and kiosks. The transaction goes through and boom, it's on-chain, final, and the grocer gets paid. What more do I want? And I'm still stuck on the idea of pure decentralization. An actual wallet-to-wallet transaction. I don't care what I buy: pesos or empanadas or a late night glass of wine. I just want to cut out the middleman. Decentralized. Permissionless. Trustless. I mean technically, yes, it's permissionless. No one can stop me from submitting a transaction to a street vendor. I can sign it. It'll show up on a block explorer. But I can't force the street vendor to accept my transaction and give me empanadas. You can't route around human consent. I feel stupid explaining how confused I feel about all this, so instead, I try to be amusing by telling them the story of buying candy with BCH. An Argentine with a cone holding two identical scoops of pink-orange ice cream explains to me that to trade stablecoins for pesos, you need a friend who knows a friend. \"That's how it works in Buenos Aires.\" Someone murmurs cuevas in the background. He nods, that's what he's talking about. Blackmarket traders. They no longer operate in actual caves, I've read, just secret spaces. Tiny, nondescript back offices, hidden behind the magazine racks inside a news kiosk, in the back of a lingerie shop, or up a dodgy elevator in an old building. It's exactly what I am wondering about. It sounds scary. I also wonder: What kind of lunatic gets two scoops of ice cream and then only chooses one flavor? He tells me that it's all pomelo, grapefruit, and that he has no regrets. \"So,\" I say, trying to look cool about asking the Pomelo-loving-man half my age for underground stablecoin hookups in an ice cream shop. \"Do you have a friend?\" \"I do.\" And just like that, I have a way forward. I will either make good on my challenge or get murdered in a Buenos Aires back alley. Luckily, I don't have enough crypto to be worth murdering, which even the most greedy bad guy can guess from my faded jeans and sweat-shop t-shirts that I've been hand-washing in the sink. I find Pomelo again before the event ends, refusing to risk his disappearing into the shadows of Subte Línea D. I hand him a business card. \"It has my email address,\" I explain. He looks at me like I just gave him a fax number. \"Don't you have Telegram?\" Of course I do, yes, and he promises to add me as a contact. It's not a big deal though, Pomelo warns me. It sounds like it's pretty shady but really it isn't. \"I just want to be able to say that I've done it,\" I tell him. I promise that I'm not expecting anything cloak and dagger. He'll be in touch, he says. I try not to show how excited I am. The following day is Pride and Avenida de Mayo is a glorious chaos of queer, cocktails, drums, glitter and screaming. I bounce through the crowds all afternoon, sipping Fernet and Coke and trying to pretend like it doesn't taste like cough syrup. Later, walking back through Microcentro on a piece of sidewalk just wide enough for one polite person, I feel something brush the top of my head. I stop, look up, look back, reach into my hair like a chimp checking for lice. Two men and a woman, walking tightly together, pass me. As they do, the woman says something low and quick in Spanish, too fast to understand, too deliberate to ignore. I think she's telling what's in my hair and I'm mostly hoping that it isn't bird shit. But I'm also thrown. She's not smiling. She's not trying to be helpful. I pat my head a bit more, finding nothing. As I continue, I see the same trio standing in a doorway, talking. As I pass, they fall in behind me again. I'm still wondering what the woman said to me, and why. It's not until I am back in my room that I realise my back pocket is empty. I have been pickpocketed. They stole my pink keyboard. --- Up next is Part Five: Going Bankless (From tourist shop hack to cueva contact)"
    },
    {
      "title": "Solidity Team Plans to Remove Inheritance From the Language Entirely",
      "author": "mudgen",
      "url": "https://www.reddit.com/r/ethereum/comments/1pam9ew/solidity_team_plans_to_remove_inheritance_from/",
      "published": 1764519659.0,
      "thumbnail": null,
      "external_url": "https://x.com/mudgen/status/1994927714726212077",
      "site_name": "X (formerly Twitter)",
      "favicon": "https://abs.twimg.com/responsive-web/client-web/icon-ios.77d25eba.png",
      "description": null
    },
    {
      "title": "Daily General Discussion November 30, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1paavb7/daily_general_discussion_november_30_2025/",
      "published": 1764482460.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "Part Three: WE ACCEPT BITCOIN (sort of)",
      "author": "Twelvemeatballs",
      "url": "https://www.reddit.com/r/ethereum/comments/1p9yafu/part_three_we_accept_bitcoin_sort_of/",
      "published": 1764446480.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "This is Part Three of the eight-part series: Can I Pay With This: A stablecoin experiment in Buenos Aires. Thank you to the Ethereum Foundation and the EV Mavericks for their support, without which this experiment could never have happened. Part One: Decentralized or Destitute Money, monkeys and mild terror Part Two: First Contact with Reality KYC on a hostel bunk bed Part Three: WE ACCEPT BITCOIN (sort of) <-- you are here My first on-chain candy The more I dig through the smoldering ruins of Argentina's last thirty years of fiscal misadventure, the clearer it gets. Stablecoins aren't a tech flex, they are life rafts. People aren't clinging to centralized exchanges like Binance and Bybit because they don't understand DeFi. They are doing it because they've already lived through hyperinflation, default,and enough broken promises to wallpaper the presidential suite in the Casa Rosada. Decentralization sounds like a luxury item when your savings are vaporizing during your morning commute. As I enter the pedestrian streets of Calles Florida and Lavalle, the chorus of shouts offering to exchange dollars for pesos underscores my thoughts. People don't trust banks and for good reason. In 2001, the government froze bank accounts. Overnight, everyone lost access to their life savings. In most of the world, we're still trying to explain what a stablecoin is. Here, trust has already migrated away from governments and banks, to USDT, USDC, DAI, and whatever else has a shot at holding its value overnight. The challenge isn't crypto adoption; it's building trustless tools that are as easy and reliable as the rickety-but-working systems they already rely on. I'm halfway through congratulating myself on this insight when the view through a large shop stops me cold. La Golosinería is a brightly lit hellscape of Halloween kitsch with boxes of candies piled high among displays of plastic pumpkins in nuclear-orange and pitch-black. But what stops me is a paper print out near the check-out with the words WE ACCEPT BITCOIN with the Bitcoin Cash symbol lurking underneath. Bitcoin split in 2017 in a public meltdown with no chance of reconciliation. BTC promised security by staying with smaller blocks and slower speeds. BCH stormed off in a huff to develop bigger blocks to lower fees and speed up transactions, which would make it actually viable to use it on a day-to-day basis. Both are very clear that they represent Satoshi's actual vision. Both call themselves Bitcoin. Funnily enough, I own exactly two Bitcoin Cash tokens, as the person who got me into crypto insisted it was technically superior. BTC is trading over $100,000 per token. BCH? About $500. I've kept the tokens for sentimental reasons. That evening, out of some sort of mix of curiosity and masochism, I set up a Bitcoin.com wallet on my burner phone and move a twentieth of a Bitcoin Cash token over, around $25. I'm not sure how much Halloween candy I need to buy to avoid looking like I am trying to launder digital money in a candy store. The next morning, I lose my way in the Buenos Aires subway system for over an hour, long enough to wonder if I might never surface again, living below the surface on churros and dread. After several laps of confusion, I emerge into daylight and find my way back to La Golosinería. I rifle through the sugar bombs and gummy worms looking for something vaguely healthy and get into line.Argentines, God bless them, are absolute professionals at standing in line. One queue. Three tills. Nobody cuts. No chaos. Except for me. There are three clerks working the tills: two women looking like they've seen too many candy seasons and one disturbingly enthusiastic kid who looks much too happy to be working in a Halloween shop the day before Halloween. He is stationed nearest the WE ACCEPT BITCOIN sign. Target acquired. I step in and out of the line, pretending to suddenly care deeply about boxed nougat imported from Spain, ignoring the dirty looks from the rest of the queue. It works. The kid smiles like he's won a prize for just existing and scans my candy. “Dos mil setecientos pesos.” 2,700 pesos. I tap the curling printout taped to the wall. \"Is it true that I can pay with Bitcoin cash?\" \"Yes, you can!\" He looks very proud until he realizes that I actually intend to do so. \"Of course, of course you can, no problem.\" Each repetition a little less convincing. He ducks behind the counter to fiddle with something unseen, probably to generate a BCH QR code. Whatever he's trying to do, it's not happening. He turns to the woman at the next till to ask for help, pointing to the unseen device. She doesn't even look at it. She has no idea and she doesn't care. She turns to me. \"Can't you just pay with Mercado Pago?\" \"Yes,\" I say, smiling my most sincere smile. \"But I want to try this.\" She sighs and goes back to her customer, her patience exhausted. But the kid, bless him, is invested. He's in too deep to give up now. He calls someone, breathlessly explaining that he has a customer that wants to pay with Bitcoin and what the hell does he do? He listens, nods, looks at me with renewed purpose. He tells me to scan the QR code on the Bitcoin sign. It opens a confirmation screen asking me if I'd like to transact with a completely different business name and how much I want to to transfer. Oh god, it's in US dollars. \"How much is it in dollars?\" He has no idea and no way is he asking the woman for help again. \"OK. Give me a sec.\" I find the currency selector. Argentina is at the top. I type in 2,700 ARS. \"Wait, wait wait!\" He stops me. \"Don't send it yet.\" He's back on the phone, talking it through. I hover, tapping my screen to keep it from fading. More conversation and then he's back. \"Now. Now, yes. Now you can send it.\" He leans in to watch as I press the button. I turn the phone to him to show him that the transaction is successful. He's back on the phone. \"She sent it! Did you get it?\" A pause and he hands over the candy like I'm some overaged trick-or-treater at his door. \"He got it!\" We have achieved a successful blockchain transaction. My BCH haul: Pipas mini crack fuego Bull Dog regaliz, sabor sandia Spicy honey roasted maní desde el campo I have proven that if I have to live off of crypto alone in Buenos Aires, I will not starve. As I step out into the street, I consider that this still doesn't quite fit my objective of a decentralised purchase without a middle man. Because ... the kid was clearly on the phone speaking to the person with the Bitcoin Cash wallet. Three people are needed to buy 2,700 worth of snacks: me, the BCH person and the kid in the middle. I cross the massive Avenida 9 de Julio, passing under the shadow of the Obelisk. The texture of the neighborhood changes. The shops thin out. There are people but very few tourists. It doesn't feel dangerous but definitely quieter. Grittier. I stop to take a photo of a crumbling building with ivy crawling over the cracks. Behind me, I hear someone stumble to a halt. A man, too close, turns and leans against the wall, staring across the street, like there is something very important over there. I look across the street to see what caught his interest. A shuttered shop front. A parked car. A plastic bag flutters in the gutter. My half-mumbled apology for stopping in front of him dies on my lips. If he were just some random pedestrian, he would've kept walking. Or glared. Or grunted and sidestepped. Not...stopped. I look back at the man but he's gone. --- Part Four: Eighteen Ways to Pay for Ice Cream (Stablecoins, FX hell and a missing keyboard)."
    }
  ],
  "fetched_at": "2025-12-01T18:55:04.664509+00:00"
}