{
  "subreddit": "ethereum",
  "posts": [
    {
      "title": "Daily General Discussion November 30, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1paavb7/daily_general_discussion_november_30_2025/",
      "published": 1764482460.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "Part Three: WE ACCEPT BITCOIN (sort of)",
      "author": "Twelvemeatballs",
      "url": "https://www.reddit.com/r/ethereum/comments/1p9yafu/part_three_we_accept_bitcoin_sort_of/",
      "published": 1764446480.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "This is Part Three of the eight-part series: Can I Pay With This: A stablecoin experiment in Buenos Aires. Thank you to the Ethereum Foundation and the EV Mavericks for their support, without which this experiment could never have happened. Part One: Decentralized or Destitute Money, monkeys and mild terror Part Two: First Contact with Reality KYC on a hostel bunk bed Part Three: WE ACCEPT BITCOIN (sort of) <-- you are here My first on-chain candy The more I dig through the smoldering ruins of Argentina's last thirty years of fiscal misadventure, the clearer it gets. Stablecoins aren't a tech flex, they are life rafts. People aren't clinging to centralized exchanges like Binance and Bybit because they don't understand DeFi. They are doing it because they've already lived through hyperinflation, default,and enough broken promises to wallpaper the presidential suite in the Casa Rosada. Decentralization sounds like a luxury item when your savings are vaporizing during your morning commute. As I enter the pedestrian streets of Calles Florida and Lavalle, the chorus of shouts offering to exchange dollars for pesos underscores my thoughts. People don't trust banks and for good reason. In 2001, the government froze bank accounts. Overnight, everyone lost access to their life savings. In most of the world, we're still trying to explain what a stablecoin is. Here, trust has already migrated away from governments and banks, to USDT, USDC, DAI, and whatever else has a shot at holding its value overnight. The challenge isn't crypto adoption; it's building trustless tools that are as easy and reliable as the rickety-but-working systems they already rely on. I'm halfway through congratulating myself on this insight when the view through a large shop stops me cold. La Golosinería is a brightly lit hellscape of Halloween kitsch with boxes of candies piled high among displays of plastic pumpkins in nuclear-orange and pitch-black. But what stops me is a paper print out near the check-out with the words WE ACCEPT BITCOIN with the Bitcoin Cash symbol lurking underneath. Bitcoin split in 2017 in a public meltdown with no chance of reconciliation. BTC promised security by staying with smaller blocks and slower speeds. BCH stormed off in a huff to develop bigger blocks to lower fees and speed up transactions, which would make it actually viable to use it on a day-to-day basis. Both are very clear that they represent Satoshi's actual vision. Both call themselves Bitcoin. Funnily enough, I own exactly two Bitcoin Cash tokens, as the person who got me into crypto insisted it was technically superior. BTC is trading over $100,000 per token. BCH? About $500. I've kept the tokens for sentimental reasons. That evening, out of some sort of mix of curiosity and masochism, I set up a Bitcoin.com wallet on my burner phone and move a twentieth of a Bitcoin Cash token over, around $25. I'm not sure how much Halloween candy I need to buy to avoid looking like I am trying to launder digital money in a candy store. The next morning, I lose my way in the Buenos Aires subway system for over an hour, long enough to wonder if I might never surface again, living below the surface on churros and dread. After several laps of confusion, I emerge into daylight and find my way back to La Golosinería. I rifle through the sugar bombs and gummy worms looking for something vaguely healthy and get into line.Argentines, God bless them, are absolute professionals at standing in line. One queue. Three tills. Nobody cuts. No chaos. Except for me. There are three clerks working the tills: two women looking like they've seen too many candy seasons and one disturbingly enthusiastic kid who looks much too happy to be working in a Halloween shop the day before Halloween. He is stationed nearest the WE ACCEPT BITCOIN sign. Target acquired. I step in and out of the line, pretending to suddenly care deeply about boxed nougat imported from Spain, ignoring the dirty looks from the rest of the queue. It works. The kid smiles like he's won a prize for just existing and scans my candy. “Dos mil setecientos pesos.” 2,700 pesos. I tap the curling printout taped to the wall. \"Is it true that I can pay with Bitcoin cash?\" \"Yes, you can!\" He looks very proud until he realizes that I actually intend to do so. \"Of course, of course you can, no problem.\" Each repetition a little less convincing. He ducks behind the counter to fiddle with something unseen, probably to generate a BCH QR code. Whatever he's trying to do, it's not happening. He turns to the woman at the next till to ask for help, pointing to the unseen device. She doesn't even look at it. She has no idea and she doesn't care. She turns to me. \"Can't you just pay with Mercado Pago?\" \"Yes,\" I say, smiling my most sincere smile. \"But I want to try this.\" She sighs and goes back to her customer, her patience exhausted. But the kid, bless him, is invested. He's in too deep to give up now. He calls someone, breathlessly explaining that he has a customer that wants to pay with Bitcoin and what the hell does he do? He listens, nods, looks at me with renewed purpose. He tells me to scan the QR code on the Bitcoin sign. It opens a confirmation screen asking me if I'd like to transact with a completely different business name and how much I want to to transfer. Oh god, it's in US dollars. \"How much is it in dollars?\" He has no idea and no way is he asking the woman for help again. \"OK. Give me a sec.\" I find the currency selector. Argentina is at the top. I type in 2,700 ARS. \"Wait, wait wait!\" He stops me. \"Don't send it yet.\" He's back on the phone, talking it through. I hover, tapping my screen to keep it from fading. More conversation and then he's back. \"Now. Now, yes. Now you can send it.\" He leans in to watch as I press the button. I turn the phone to him to show him that the transaction is successful. He's back on the phone. \"She sent it! Did you get it?\" A pause and he hands over the candy like I'm some overaged trick-or-treater at his door. \"He got it!\" We have achieved a successful blockchain transaction. My BCH haul: Pipas mini crack fuego Bull Dog regaliz, sabor sandia Spicy honey roasted maní desde el campo I have proven that if I have to live off of crypto alone in Buenos Aires, I will not starve. As I step out into the street, I consider that this still doesn't quite fit my objective of a decentralised purchase without a middle man. Because ... the kid was clearly on the phone speaking to the person with the Bitcoin Cash wallet. Three people are needed to buy 2,700 worth of snacks: me, the BCH person and the kid in the middle. I cross the massive Avenida 9 de Julio, passing under the shadow of the Obelisk. The texture of the neighborhood changes. The shops thin out. There are people but very few tourists. It doesn't feel dangerous but definitely quieter. Grittier. I stop to take a photo of a crumbling building with ivy crawling over the cracks. Behind me, I hear someone stumble to a halt. A man, too close, turns and leans against the wall, staring across the street, like there is something very important over there. I look across the street to see what caught his interest. A shuttered shop front. A parked car. A plastic bag flutters in the gutter. My half-mumbled apology for stopping in front of him dies on my lips. If he were just some random pedestrian, he would've kept walking. Or glared. Or grunted and sidestepped. Not...stopped. I look back at the man but he's gone. --- Up next is Part Four: Eighteen Ways to Pay for Ice Cream (Stablecoins, FX hell and a missing keyboard)."
    },
    {
      "title": "Daily General Discussion November 29, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1p9hczs/daily_general_discussion_november_29_2025/",
      "published": 1764396054.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "From the \"human world computer\" to the \"technological world computer\"",
      "author": "johanngr",
      "url": "https://www.reddit.com/r/ethereum/comments/1p9uqhr/from_the_human_world_computer_to_the/",
      "published": 1764437733.0,
      "thumbnail": "https://external-preview.redd.it/IOp8OgmCgNxVmojQLoYsdyvoBs5nj8qynnGfagJSuj0.jpeg?width=320&crop=smart&auto=webp&s=190ce4b86693ae4cebd65309f9f80c9e189c6d50",
      "external_url": "https://open.substack.com/pub/johan310474/p/from-the-human-world-computer-to",
      "site_name": "open.substack.com",
      "favicon": null,
      "description": null
    },
    {
      "title": "First Contact with Reality (Part Two of Can I Pay With This?)",
      "author": "Twelvemeatballs",
      "url": "https://www.reddit.com/r/ethereum/comments/1p95o9m/first_contact_with_reality_part_two_of_can_i_pay/",
      "published": 1764362826.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "This is Part Two of the eight-part series: Can I Pay With This? A stablecoin experiment in Buenos Aires Part One: Decentralized or Destitute Money, monkeys and mild terror Part Two: First Contact with Reality <-- you are here KYC on a hostel bunk bed I arrive in Buenos Aires and immediately discover that Twitter has lied to me. Various digital nomads had insisted that there was no need for cash in Buenos Aires anymore. Don't bother bringing dollars or euros. It is true that Argentina is currently in a period of relative exchange stability after years of crippling inflation (for ex, 211% in 2023). Using a foreign credit or debit card then meant you'd get the terrible Official Rate. In reality, everyone used the black market Blue Rate which at times could give you almost double as many pesos for your dollars. But now that the two rates have converged, the Twitterati explained, it is safe to use your cards again. I believed them. Now I have regrets. The taxi app crashes; the driver is happy to take me anyway for the original amount or even a discount, but he will only accept pesos in cash. My hostel wants a cash deposit for the towel. The first coffee shop I walk into has a big sign: We do not take cards. The man at the subway won't let me top up my newly acquired SUBTE card unless I handed over cash pesos. Not to mention restaurants offering discounts ranging from 10% to an eyewatering 25% just for paying with actual paper money. And let's not talk about the obvious scowls if I even think about tipping my server using my card. I need to find out how to get cash, fast. The hostel owner gives the same lecture to every new arrival. Yes, you can get pesos on the black market. However, here are the neighbourhoods that you must not enter if you value your life. Keep your money in your pocket whenever you are outside. Don't take selfies unless you want to lose your phone. He shrugs confusedly when I ask if I can trade stablecoins for pesos. I need dollars, he tells me. Once he's convinced that I'm taking him seriously, he gives me directions to a man in a jewelry shop whom he trusts, who will buy my Euros. Don't trade with anyone outside on the street, he tells me. It's dangerous. I can pay the towel deposit later, don't worry. Just be safe! Don't trade on the street. The streets in question, Calles Lavalle and Florida, are full of men and women calling cambio, cambio, cambio de dolares! every few meters. Mindful of the hostel advice, I ignore them and walk to the jewelry store. A man outside asks if I want to trade and waves me into the tiny shop with an old man sitting with a large cash register. Watches of various values are laid out on the counter. When I ask if they take stablecoins, he actually laughs. I try again: What about debit cards? Only if I wanted to buy a watch. I trade 50 euro for many tens of thousands of pesos. I feel conspicuous carrying this much cash, unsafe. I try not to look vulnerable. I'm crossing a road when a guy walking towards me passes too closely, brushing my shoulder. There was plenty of room and no reason for it. I turn to see who bumped into me and discover he's turned too, standing a few meters behind me, staring at me. As our eyes lock, he turns again and walks away. That evening, another resident tells me that he didn't bother with the owner's instructions. It was easy to get pesos, he says. \"I just walked up to some guy on the street and handed him $500.\" Peer to peer, yes. But I think I'm not that brave. I unpack my three T-shirts and two Android phones and a tablet and a keyboard for the tablet and another travel keyboard, a cute little pink thing that folds up, which I keep in the back pocket of my hoodie, so it is easy access to pull out and use with my phone in coffee shops. The next assignment: wrestle with a pile of Argentine Web3 apps promoted by Devconnect to showcase Argentine innovation. They aren't wrong. Argentina is certainly punching above its weight when it comes to Web3 development. There's an almost romantic backstory there, going back to innovation hubs like Casa Voltaire (2014-2016) which led to actual, very-real projects such as Decentraland and OpenZeppelin. Today, Argentina ranks second in Latin America for Web3 developers, despite having only a fraction of the population of Brazil or Mexico. Grassroots communities such as Ethereum Argentina and Crecimiento are dedicated to transforming the country into LATAM's crypto capital. But when I download the apps, I discover that they are not for meant for me. Lemon Cash and Belo require a national identity number from a South American country. Ripio lists six countries, including Mexico and - unexpectedly - USA residents and non-residents. As a non-resident of the USA, I start filling in their form, which happily accepts my Euro-credentials and then asks me to upload a copy of my W8BEN, which is essentially the IRS asking you to declare that you are not an American, so they can find some other way to punish you. I back out quietly and delete the app. The tablet's keyboard fails on the first day, the bluetooth connection hiccupping and disconnecting. The smaller pink keyboard will work for both phone and tablet, however, and I feel smug that I have built-in redundancy. I get back to work with barely a hitch. I see someone talking about payment solutions on the DevConnect Telegram channel. A new batch of Web3 apps with an elegant premise: use a stablecoin wallet to pay merchants who use the QR-code system in Argentina. Grocery stores, pharmacies and little kiosks that sell novelty mate mugs all accept QR payments, in a system regulated by the Central Bank of Argentina under the Tranferencias 3.0 initiative. It's not quite escaping traditional finance, but the initiative requires that all payment service providers and banks use the same standardized QR code generator. The Web3 apps plug into the QR scaffolding that already exists, allowing me to hold stablecoins (USDC or USDT, depending on the app) and spend in pesos. KYC is required to comply with local regulations. I quickly try Peanut and Yodl, which both offer QR payments for Argentina and Brazil, Yodl also works in Vietnam and the Philippines. To my surprise, the Know Your Customer (KYC) isn't completely soul-crushing. I enter my address, upload my passport screenshot and minutes later I can move money into my wallet using one of a number of Ethereum Layer 2s designed to make transactions faster and cheaper. Both use Arbitrum, which is a relief. Peanut wants USDC, Yodl wants USDT . This isn't to say that I was happy with KYC as a part of my solution. This is the requirement to collect personal identifying data to ensure that you, as a provider, can prove that you \"know your customer\". KYC regulations require that financial applications collect information about their users in order to reduce money laundering and financial fraud, despite billions poured into compliance yearly with little noticeable impact, if any. An additional catch is that many applications use KYC as an excuse to collect additional data or to filter out customers that they don't like. KYC info is often used as an anti-sybil measure. Ether.fi rejected me because I live in a country that they don't want to deal with. And I'm still feeling salty about going through KYC with Monerium when it was in beta, who then informed me that I couldn't have an account because I wasn't notable enough. I am apparently too boring for the future of finance. But also... this KYC is easy for me because I'm exactly who financial systems want to offer accounts to. I have a passport from a country that matters, my name linked to an address that exists on official forms, documentation proving I am who I claim to be. I thought that part of the point of alternative finance was to help those people that banks won't or can't serve. Meanwhile, I'm sitting cross-legged on a hostel bunk, surrounded by charging cables, relying on the hostel's Wi-Fi signal remaining strong enough to upload another photograph of my passport. The future of finance still seems to require centralized government approval. Another issue: So far, everything I've looked at makes me transfer my money from my wallet to theirs. I instinctively want to say that they are custodial. But no: the apps all say that they are self-custodial, which is confusing the hell out of me. I can't link my own wallet. I have to send funds from my wallet to a wallet in their app. How is that self-custody? Peanut uses passkeys, saved with Apple or Google, rather than trusting me to store my own details. There is no way to gain control of the wallet they create on my behalf. Their docs insist that it is self-custodial because they don't actually hold the funds and can't spend them on my behalf. I can kinda see the argument, if what they mean is that thewallet is not custodial. But I don't think \"we can't spend your money for you\" is what self-custody means. Yodl seems better in this regard: they generate an embedded wallet using Privy and apparently it is possible to gain control of the wallet by bypassing Yodl and using Privy options to export your keys. I have no idea how to do this and I had to wade through their terms and conditions to even find that information. Neither app has any option for exporting the wallet or any option at all, other than to submit a transaction to withdraw the funds to another wallet. There are no details on recovery. As of right now, if they disappear overnight, so does my money. On the other hand, I understand that they want to make their apps straight-forward. I appreciate that these middlemen are the only reason that I can buy empanadas without explaining smart contracts to a bakery. They are connecting Web3 to meatspace by plugging into an existing QR system, which is truly useful. I distinctly feel that they don't want to be gatekeepers, they want to be guides. But it doesn't feel right. I'm learning that sometimes words in DeFi don't mean what I think they mean. I consider renaming my challenge. Decentralized-ish with bonus Customer Support or Destitute except for a wallet full of cash and three cards . --- Can I Pay With This? Table of Contents Part 1: Decentralized or Destitute Money, monkeys and mild terror Part 2: First Contact with Reality <-- you are here KYC on a hostel bunk bed Next up: WE ACCEPT BITCOIN (sort of)"
    },
    {
      "title": "Daily General Discussion November 28, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1p8ndob/daily_general_discussion_november_28_2025/",
      "published": 1764309671.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "To truly \"Be Your Own Bank,\" you must trust your code, not your vendor.",
      "author": "unchikuso",
      "url": "https://www.reddit.com/r/ethereum/comments/1p93ucz/to_truly_be_your_own_bank_you_must_trust_your/",
      "published": 1764358314.0,
      "thumbnail": null,
      "external_url": "https://brainwallet.io",
      "site_name": "Brainwallet.io",
      "favicon": "https://brainwallet.io/favicon.ico",
      "description": "Open source client-side cryptocurrency wallet generator for Bitcoin, Litecoin, Ethereum, and Dogecoin. Secure offline paper wallet and cold storage solution."
    },
    {
      "title": "Honest Opinions About Crypto Games",
      "author": "BodybuilderOk96",
      "url": "https://www.reddit.com/r/ethereum/comments/1p8twe2/honest_opinions_about_crypto_games/",
      "published": 1764333730.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "So crypto games have a bad rap in mainstream because of past scams. Also, a lot of them get criticized because of the poor gameplay quality, and because of the fact that they focus more on earning rather than the actual gameplay mechanics (which I agree with). However, using crypto seems beneficial because you can track all of the transactions on the blockchain online (nothing is hidden). If, for example, you do an esports type of tournament with a cash prize pool given to players, you can literally track how that pool is given to players on the blockchain. But without crypto, you have to trust the companies on how the pool is being distributed (because you don't know what their doing behind the scene). Also, the transaction fees with some crypto chains are pretty low (in the milli-cents, compared to using credit cards to buy in-game virtual currencies, like Fortnite VBucks)... But the fact that crypto games haven't taken off tells me that gamers really don't care about transparency and fees...They trust the centralized gaming companies/publishers, and are willing to pay premiums for skins and other in-game assets without being the true owners of those assets. As gamers, do you guys agree with this? Do you see any case where gamers would prefer to transition to crypto instead of traditional credit card systems?"
    },
    {
      "title": "Ethereal news weekly #0 | Gas limit increased to 60M, Fusaka upgrade December 3, FOCIL not in Glamsterdam upgrade",
      "author": "abcoathup",
      "url": "https://www.reddit.com/r/ethereum/comments/1p8szlr/ethereal_news_weekly_0_gas_limit_increased_to_60m/",
      "published": 1764330756.0,
      "thumbnail": "https://external-preview.redd.it/2zyY6e5Mf5R63ELydbdrYjrz_yIBJn5i9-GpP66kmzM.jpeg?width=640&crop=smart&auto=webp&s=5a0bcc467e92ab01c45c72e2085e5e0169e799e6",
      "external_url": "https://ethereal.news/ethereal-news-weekly-0/",
      "site_name": "ethereal.news",
      "favicon": "https://ethereal.news/favicon.svg",
      "description": "Gas limit increased to 60M, Fusaka upgrade December 3, FOCIL not in Glamsterdam upgrade"
    },
    {
      "title": "Highlights from the All Core Developers Consensus (ACDC) Call #170",
      "author": "Y_K_C_",
      "url": "https://www.reddit.com/r/ethereum/comments/1p8ohcl/highlights_from_the_all_core_developers_consensus/",
      "published": 1764313582.0,
      "thumbnail": "https://external-preview.redd.it/php-M-NLxCgSac5E4Dj2KndnspYHHF-ssha1g4RX4Us.jpeg?width=640&crop=smart&auto=webp&s=04992eed5e29f6a9028044f5370d1443bbc21a76",
      "external_url": "https://etherworld.co/2025/11/27/highlights-from-the-all-core-developers-consensus-acdc-call-170/",
      "site_name": "EtherWorld.co",
      "favicon": "https://etherworld.co/favicon.png",
      "description": "Ethereum developers juggle Fusaka launch, Glamsterdam finalization, & early Heka talks during ACDC #170."
    }
  ],
  "fetched_at": "2025-11-30T09:16:57.739397+00:00"
}