{
  "subreddit": "robotics",
  "posts": [
    {
      "title": "Tying your shoes on a real bimanual mobile robot! ByteDance Seed just drops GR-RL, a new VLA+RL system that manages long-horizon precise dexterous manipulation of deformable objects (paper)",
      "author": "Nunki08",
      "url": "https://www.reddit.com/r/robotics/comments/1pc8kdi/tying_your_shoes_on_a_real_bimanual_mobile_robot/",
      "published": 1764682451.0,
      "thumbnail": "https://external-preview.redd.it/d2dvMjR0amlsczRnMaCiBgwQLnOBGKXTF1DSXq7q_DiQjpxh0SG0ta2h6icx.png?width=640&crop=smart&auto=webp&s=4294f9750a48be1dc1824d642e67aeeb5baded6b",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Project page: https://seed.bytedance.com/en/gr_rl ArXiv: https://arxiv.org/abs/2512.01801"
    },
    {
      "title": "Industrial Robots vs Cobots in High Volume Production - Are Cobots even relevant here?",
      "author": "whynotabtn",
      "url": "https://www.reddit.com/r/robotics/comments/1pcdcul/industrial_robots_vs_cobots_in_high_volume/",
      "published": 1764693828.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "All the research I've done comparing the two shows that industrial robots are far superior to cobots in high-volume production. Industrial robots have higher payload, better reach range, speed range, repeatability, and they meet cycle time goals better. It seems like cobots win on safety as no cages are required, are easier to program, and easier to redeploy. What even is the point of an industry - say, automotive manufacturing - adopting cobots? Some quality inspection work? Packaging? Deburring? What practical applications can justify the cost/ deployment/ maintenance costs of a cobot?"
    },
    {
      "title": "First real test of my tabletop robots",
      "author": "Adventurous_Swan_712",
      "url": "https://www.reddit.com/r/robotics/comments/1pbhwpf/first_real_test_of_my_tabletop_robots/",
      "published": 1764607900.0,
      "thumbnail": "https://external-preview.redd.it/aHZnOTl3eTdobTRnMRnKugMmOHTGB4yA-VR18AaSSDdbqEgYxF28Ho7JAicN.png?width=640&crop=smart&auto=webp&s=f59b5f4a0e7c8d15b08b6e3d4e4fe0d5296e4f6d",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "Demonstration of sanitation robots in Shenzhen last week",
      "author": "Nunki08",
      "url": "https://www.reddit.com/r/robotics/comments/1pb8geg/demonstration_of_sanitation_robots_in_shenzhen/",
      "published": 1764581393.0,
      "thumbnail": "https://external-preview.redd.it/bzE5czdsazNhazRnMZNmrQ2qSiOJZnjCQEc7estSYXQIA3irPB-JEHj5BZA9.png?width=640&crop=smart&auto=webp&s=92b1c04743b1792c22b374adc8e5adb8a376b211",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "From Tuo Liu on 𝕏: https://x.com/Robo_Tuo/status/1995314021281771644"
    },
    {
      "title": "Love robotics, hate heavy algorithm stuff — what roles fit?",
      "author": "Technical-Force-6266",
      "url": "https://www.reddit.com/r/robotics/comments/1pc7azx/love_robotics_hate_heavy_algorithm_stuff_what/",
      "published": 1764678895.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Hey all, As the title says, I love robotics and working close to hardware, but I really dislike heavy algorithm development. I’m comfortable with Python, C++, ROS2, and Linux. What junior-friendly roles could someone like me aim for? Best,"
    },
    {
      "title": "Unity app for robot control??",
      "author": "Full_Connection_2240",
      "url": "https://www.reddit.com/r/robotics/comments/1pc5zd0/unity_app_for_robot_control/",
      "published": 1764674522.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Hobby robotics has few apps to build a digital twin for inverse kinematics/simulation of custom robots. As far as I know the best we got is ROS2 which isn't worth the effort for most people who could write custom code in half the time it takes to learn how to install and set up ROS. Would you use unity to build a highly visual/intuitive interface to remotely control your custom bot? Through a serial port that is.."
    },
    {
      "title": "[Beta Release] AI Workbench for Educational Robotics",
      "author": "ur-guy-sahith",
      "url": "https://www.reddit.com/r/robotics/comments/1pcdsqs/beta_release_ai_workbench_for_educational_robotics/",
      "published": 1764694804.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Hi everyone! I’m part of FTC Team 9045 Greenhill Hornet Robotics. We’ve been working on an AI tool that started as a helper for FTC teams, and we're trying to grow it into something useful for many educational robotics environments that use Java, computer vision, or real-time control loops. We’re launching a beta version and would love feedback from yall! What the AI Workbench Does The tool functions as an AI programming assistant that can: - Generate or debug Java-based robot code Help set up autonomous routines, motion planning, and state machines - Explain control theory concepts - Build and analyze vision pipelines (AprilTags, object detection, etc.) - Provide structured diffs to improve or extend existing code - Assist new learners with foundational programming questions Although the training corpus is rooted in FTC materials (SDK, Road Runner, Limelight docs, etc), the tool behaves like a general robotics coding assistant capable of helping with: - PID control - Localization - Kinematics - Sensor fusion - Finite state machines - Vision processing - System architecture This is an early release, and we’d genuinely appreciate any feedback yall might have. Everything runs server-side, so no user API keys are needed, and nothing sensitive is stored in the browser. Try it here: https://ai-ftc.vercel.app/workbench We’re excited to push this further- and any feedback or critiques are hugely appreciated!"
    },
    {
      "title": "Chinese T800 Full-Size General Humanoid Robot Officially Launched to Disrupt",
      "author": "DifferentAd7239",
      "url": "https://www.reddit.com/r/robotics/comments/1pc3oxo/chinese_t800_fullsize_general_humanoid_robot/",
      "published": 1764665860.0,
      "thumbnail": "https://external-preview.redd.it/ZcoEiGnDsqT6-TTFzf3-FSfQkaPnZQjQjgCIxIaZz3g.jpeg?width=320&crop=smart&auto=webp&s=4c1e8071049f50936b614b7fbd10562a13e87c33",
      "external_url": "https://www.youtube.com/watch?v=J5L3Y-Qtdaw",
      "site_name": "youtube.com",
      "favicon": "https://www.youtube.com/s/desktop/76a077af/img/favicon.ico",
      "description": "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube."
    },
    {
      "title": "CV API Library for Robotics (6D Pose → 2D Detection → Point Clouds). Where do devs usually look for new tools?",
      "author": "Open_Perspective_506",
      "url": "https://www.reddit.com/r/robotics/comments/1pc29pt/cv_api_library_for_robotics_6d_pose_2d_detection/",
      "published": 1764660298.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Hey everyone, I’m working at a robotics / physical AI startup and we’re getting ready to release step-by-step a developer-facing Computer Vision API library. It exposes a set of pretrained and finetunable models for robotics and automation use cases, including: 6D object pose estimation 2D/3D object detection Instance & semantic segmentation Anomaly detection Point cloud processing Model training / fine-tuning endpoints Deployment-ready inference APIs Our goal is to make it easier for CV/robotics engineers to prototype and deploy production-grade perception pipelines without having to stitch together dozens of repos. We want to share this with the community to: collect feedback, validate what’s useful / not useful, understand real workflows, and iterate before a wider release. My question: Where would you recommend sharing tools like this to reach CV engineers and robotics developers? Any specific subreddits? Mailing lists or forums you rely on? Discord/Slack communities worth joining? Any niche places where perception folks hang out? If anyone here wants early access to try some of the APIs, drop a comment and I’ll DM you. Thanks a lot, any guidance is appreciated!"
    },
    {
      "title": "Closed kinematic loop in gazebo",
      "author": "PuzzleheadedFloor749",
      "url": "https://www.reddit.com/r/robotics/comments/1pc1c4u/closed_kinematic_loop_in_gazebo/",
      "published": 1764656882.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "How would I add closed kinematic loop for gazebo with multiple parents. I tried to make it with detachable joint plugin, but it's not working exactly... As the detachable plugin is not even being active. Could somebody help? What's the standard approach?"
    }
  ],
  "fetched_at": "2025-12-02T17:32:13.832175+00:00"
}