{
  "subreddit": "robotics",
  "posts": [
    {
      "title": "For home robots, does a humanoid form factor actually make engineering sense?",
      "author": "BigGirl367",
      "url": "https://www.reddit.com/r/robotics/comments/1pa7742/for_home_robots_does_a_humanoid_form_factor/",
      "published": 1764470863.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "This is a strictly engineering-focused question — not about long-term predictions, consumer markets, or sci-fi use cases. Humanoids are getting a lot of visibility lately (Optimus, Unitree H1, XPeng, Atlas, etc.). It made me curious about the actual engineering trade-offs when the target environment is a typical home. From a design and controls standpoint, the two approaches seem to have very different constraints. Potential engineering advantages of humanoid designs: • human-height workspace • access to existing tools, handles, and switches • whole-body manipulation possibilities • able to navigate human-scale indoor layouts without modifying the environment Potential engineering advantages of non-humanoid mobile manipulators: • lower BOM and simpler actuation • fewer DOF → lower control complexity • wheels = far fewer failure modes • lower power requirements • easier to reach appliance-tier reliability • more predictable motion (pets/kids safe) You don’t need to frame this in market terms — I’m mostly trying to build a clearer mental model for ongoing work related to home-environment autonomy. A lot of current projects (mine included) are running into similar failure modes in manipulation, reliability, and task generalization, so I’m curious how others here rank the practical constraints today. From an engineering standpoint, what seems like the real bottleneck right now? • manipulation robustness? • cost of reliable hardware? • locomotion complexity (balancing vs wheeled)? • or just the number of corner cases in household tasks? Would love to hear how people here think about current, real-world design constraints."
    },
    {
      "title": "Unitree R1 & G1 are showing off their skills together",
      "author": "Nunki08",
      "url": "https://www.reddit.com/r/robotics/comments/1paftdv/unitree_r1_g1_are_showing_off_their_skills/",
      "published": 1764501084.0,
      "thumbnail": "https://external-preview.redd.it/cXc1NGg0MzNuZDRnMTKOMTlUNUyjQprjxN6HIAw27V_NWy5ur8MFKoBmAQ83.png?width=640&crop=smart&auto=webp&s=4a1f30ca47fba10e94b8c084358fef36e43d28ff",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "From RoboHub🤖 on 𝕏: https://x.com/XRoboHub/status/1994820845311832267"
    },
    {
      "title": "Full-size humanoid hobot LimX's Oli walks over construction debris (standing 165 cm tall and weighing 55 kg)",
      "author": "Nunki08",
      "url": "https://www.reddit.com/r/robotics/comments/1p9lmwl/fullsize_humanoid_hobot_limxs_oli_walks_over/",
      "published": 1764411688.0,
      "thumbnail": "https://external-preview.redd.it/eWd4MjducHk4NjRnMft9vFA-FNFjTxs8E3afZ-EBB4QQysHN5Jqw62PmqkrM.png?width=640&crop=smart&auto=webp&s=3151f354db997dfe4fab3361aa6ac5e71edee6a0",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "From LimX Dynamics on 𝕏: https://x.com/LimX_Dynamics/status/1994408054989987939?s=20"
    },
    {
      "title": "Ball Balancing Robot",
      "author": "JohanLink",
      "url": "https://www.reddit.com/r/robotics/comments/1p9n1hd/ball_balancing_robot/",
      "published": 1764416833.0,
      "thumbnail": "https://external-preview.redd.it/aGtrMW40bTBwNjRnMbErayzCi0ja_0kg845fe681GMgl3J5WLjfTaWRly87D.png?width=640&crop=smart&auto=webp&s=36be5efabf278b9da75633b323c247ee89954a1d",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Hey everyone, Just wanted to share a short clip of my DIY robot, BaBot, in action. It’s taken a lot of trial and error to get it to move smoothly, and I’m still tweaking things, but I’m really happy with how it turned out so far. Would love to hear any thoughts !"
    },
    {
      "title": "First live test of a laser-based local obstacle detection concept.",
      "author": "Independent_Win_Alex",
      "url": "https://www.reddit.com/r/robotics/comments/1pafmkr/first_live_test_of_a_laserbased_local_obstacle/",
      "published": 1764500415.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "This is an early experiment using a simple laser grid as a local sensing field. The rover is currently on a stand (wheels in the air) — this test focuses only on the reaction logic, not on traction or motion mechanics. How it works (basic concept): When the laser field is clear — the system allows movement. When an object enters the field — the reflected laser points appear. Once the reflection threshold is detected — motion is stopped immediately. When the obstacle is removed — movement resumes. This idea started very simply — from a regular laser pointer and curiosity about whether laser reflection can be used as a local navigation and safety layer without LIDAR. This is not a finished product. This is a raw engineering experiment — but it already demonstrates stable obstacle detection and reaction. Next steps: ground tests tuning reflection thresholds testing on moving platform combining with other sensors Sometimes innovation starts from the simplest experiments."
    },
    {
      "title": "Nema 17 Gearbox for Robotic Arm",
      "author": "Traditional_Scar_430",
      "url": "https://www.reddit.com/r/robotics/comments/1pa5x78/nema_17_gearbox_for_robotic_arm/",
      "published": 1764467009.0,
      "thumbnail": "https://a.thumbs.redditmedia.com/Zd26pKuDiU8Yi4Jzva1O6ez1ufWY-YYon6wZ3Id44X0.jpg",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "I'm working on a robotic arm project and I'm looking into using this planetary gearbox for a Nema 17 motor. https://preview.redd.it/0llh5gy8ua4g1.png?width=901&format=png&auto=webp&s=ecc0809169212c217ea7a276f67be90dd66b5077 https://preview.redd.it/jqqcigy8ua4g1.png?width=816&format=png&auto=webp&s=fb3e27aeb56050f4ab9138fee032c9471cc2b9b2 According to my calculations, the reduction is going to be 3:1 I think maybe it's not going to work well, not necessarily because they are planetary gears, but mostly because the ratio seems too low. What do you all think? Any experience with this or suggestions for better gearboxes for a Nema 17 in a robotic arm?"
    },
    {
      "title": "Christmas lights",
      "author": "Actual_Requirement58",
      "url": "https://www.reddit.com/r/robotics/comments/1padw9v/christmas_lights/",
      "published": 1764493803.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Today I set up the Christmas tree. The hardest part was untangling last years knot of lights. A electrical cord with lights, all serated in a little plastic tree design, and perfectly designed for entangement and knotting. My 7 year old tried for half an hour and couldn't do it.It took me the whole hour I reckon. My question to the community; how would robotics go at a job like this? There's times when you just need to be gentle and pull, and others when you really do need to unknot it. It's as tricky as they come."
    },
    {
      "title": "Actuator/servo",
      "author": "NoIntern2903",
      "url": "https://www.reddit.com/r/robotics/comments/1p9xup1/actuatorservo/",
      "published": 1764445370.0,
      "thumbnail": "https://a.thumbs.redditmedia.com/YP9Klcl1OT6-6xAMhULhsiYLepWK0L5m_fJh0PPffe4.jpg",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Many in the RC community haven’t been able to help a lot in these regards. Im struggling to get my servo programmed how I want it to for my RC snow plow and I’m not sure how to program two actuators to act as my angle method so one comes in when the other pushes out and vice versa the other direction. Currently I’m using an RC winch controller board on my RX to TX as my lift actuator and it works. When I tried to program two actuators to do as I wanted with the opposite wires tied together i think wires crossed and shorted the controller board. But I don’t think ot could handle two actuators anyways. I’m really wanting to keep this a simple build using a single battery if possible and on one TX. Any help appreciated. Pics are of my plow."
    },
    {
      "title": "Looking to join any embedded project (STM32, CAN, AURIX, 8051)",
      "author": "Administrative_Path3",
      "url": "https://www.reddit.com/r/robotics/comments/1pa3w1z/looking_to_join_any_embedded_project_stm32_can/",
      "published": 1764461220.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "Best countries for a robotics career (humanoids, drones, home robots) from 2026–2030?",
      "author": "Kindly-Fix-7049",
      "url": "https://www.reddit.com/r/robotics/comments/1paanag/best_countries_for_a_robotics_career_humanoids/",
      "published": 1764481697.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    }
  ],
  "fetched_at": "2025-11-30T11:23:23.192680+00:00"
}