{
  "cached_at": "2025-11-24T18:39:19.442370+00:00",
  "data": {
    "url": "https://home.web.cern.ch/news/official-news/knowledge-sharing/general-principles-use-ai-cern",
    "title": "General principles for the use of AI at CERN",
    "description": "Artificial intelligence (AI) can be found at CERN in many contexts: embedded in devices, software products and cloud services procured by CERN, brought on-site by individuals or developed in-house. Following the approval of a CERN-wide AI strategy, these general principles are designed to promote the responsible and ethical use, development and deployment (collectively “use”) of AI at CERN. They are technology neutral and apply to all AI technologies as they become available. The principles apply across all areas of CERN’s activities, including: AI for scientific and technical research: data analysis, anomaly detection, simulation, predictive maintenance and optimisation of accelerator performance or detector operations, and AI for productivity and administrative use: document drafting, note taking, automated translation, language correction and enhancement, coding assistants, and workflow automation. General Principles  CERN, members of its personnel, and anyone using CERN computing facilities shall ensure that AI is used in accordance with the following principles: Transparency and explainability: Document and communicate when and how AI is used, and how AI contributes to specific tasks or decisions. Responsibility and accountability: The use of AI, including its impact and resulting outputs throughout its lifecycle, must not displace ultimate human responsibility and accountability.   Lawfulness and conduct: The use of AI must be lawful, compliant with CERN’s internal legal framework and respect third-party rights and CERN’s Code of Conduct. Fairness, non-discrimination, and “do no harm”: AI must be used in a way that promotes fairness and inclusiveness and prevents bias, discrimination and any other form of harm. Security and safety: AI must be adequately protected to reduce the likelihood and impact of cybersecurity incidents. AI must be used in a way that is safe, respects confidentiality, integrity and availability requirements, and prevents negative outcomes.  Sustainability: The use of AI must be assessed with the goal of mitigating environmental and social risks and enhancing CERN's positive impact in relation to society and the environment. Human oversight: The use of AI must always remain under human control. Its functioning and outputs must be consistently and critically assessed and validated by a human.  Data privacy: AI must be used in a manner that respects privacy and the protection of personal data. Non-military purposes: Any use of AI at CERN must be for non-military purposes only.",
    "image": "https://cds.cern.ch/images//file?size=medium",
    "favicon": "https://home.web.cern.ch/sites/default/themes/custom/cernpublic/favicon.ico",
    "site_name": "CERN",
    "author": null,
    "keywords": "physics, CERN, Large Hadron Collider, LHC, high-energy physics, particles, science"
  }
}