{
  "subreddit": "ethereum",
  "posts": [
    {
      "title": "Daily General Discussion December 05, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1penica/daily_general_discussion_december_05_2025/",
      "published": 1764914472.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "Trump Family’s Crypto Empire Collapses: Nearly $1 Billion Wiped Out as World Liberty and Memecoins Crash",
      "author": "shadrack_CK",
      "url": "https://www.reddit.com/r/ethereum/comments/1pe06ir/trump_familys_crypto_empire_collapses_nearly_1/",
      "published": 1764855388.0,
      "thumbnail": "https://external-preview.redd.it/_d8gHOZZJgORyIb0nJddwObrhDilPHbkHJO1sj3AD28.jpeg?width=640&crop=smart&auto=webp&s=3b0f309c71d656a6e8832924d0a64d458dc101f1",
      "external_url": "https://dailyglitch.com/trump-familys-crypto-empire-collapses-what-really-went-wrong-with-world-liberty-and-memecoins/",
      "site_name": "𝐓𝐇𝐄 𝐃𝐀𝐈𝐋𝐘 𝐆𝐋𝐈𝐓𝐂𝐇",
      "favicon": "https://dailyglitch.com/wp-content/uploads/2025/08/site-icon.png",
      "description": "Trump crypto empire falls faster than bitcoin"
    },
    {
      "title": "Here's the full tech stack including ethereum rollups deployment platform we use to run our blockchain game with 10k players",
      "author": "eren_yeager04",
      "url": "https://www.reddit.com/r/ethereum/comments/1peu4wz/heres_the_full_tech_stack_including_ethereum/",
      "published": 1764938692.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "saw some questions about production web3 gaming setups so figured i'd share our full stack, we run a multiplayer game with about 10k active players. frontend: unity for game client, react for web dashboard smart contracts: solidity, hardhat for development, foundry for testing infrastructure: caldera for rollup deployment, alchemy for backup rpc calls, the graph for indexing monitoring: tenderly for transaction monitoring, sentry for error tracking deployment: github actions for ci/cd, vercel for web hosting analytics: mixpanel for user analytics, dune for on chain analytics The infrastructure piece was the biggest decision, we initially tried deploying our own rollup but it was a nightmare, switched to managed solution and shipped way faster. deployment was straightforward and support has been solid when we needed it. The biggest cost is actually alchemy for backup rpc even though we have our own nodes, turns out redundancy is worth it when you have paying users. whole stack runs about $800-1000 per month. We use both hardhat and foundry because hardhat for deployment scripts and foundry for testing since its way faster. mostly standard ethereum tools, game specific stuff is all in unity not on chain. Im happy to answer questions about any of these choices or tradeoffs we made."
    },
    {
      "title": "Ethereal news weekly #1 | 🦓 Fusaka upgrade live on mainnet ⚠️ Client diversity: Lighthouse 55% 🎂 Beacon chain 5th anniversary",
      "author": "abcoathup",
      "url": "https://www.reddit.com/r/ethereum/comments/1pesttx/ethereal_news_weekly_1_fusaka_upgrade_live_on/",
      "published": 1764934574.0,
      "thumbnail": "https://external-preview.redd.it/2zyY6e5Mf5R63ELydbdrYjrz_yIBJn5i9-GpP66kmzM.jpeg?width=640&crop=smart&auto=webp&s=5a0bcc467e92ab01c45c72e2085e5e0169e799e6",
      "external_url": "https://ethereal.news/ethereal-news-weekly-1/",
      "site_name": "ethereal.news",
      "favicon": "https://ethereal.news/favicon.svg",
      "description": "Fusaka upgrade live on mainnet, client diversity: Lighthouse 55%, Beacon chain 5th anniversary"
    },
    {
      "title": "Highlights from the All Core Developers Execution (ACDE) Call #225",
      "author": "Y_K_C_",
      "url": "https://www.reddit.com/r/ethereum/comments/1pego5o/highlights_from_the_all_core_developers_execution/",
      "published": 1764894384.0,
      "thumbnail": "https://external-preview.redd.it/K1RcM0LAadD7-6wwPZdTDKsNMd1iU6IoBFkKvn3bc54.png?width=640&crop=smart&auto=webp&s=539183c7c9064c060e9a9f3e9986f6338b07c25e",
      "external_url": "https://etherworld.co/2025/12/04/highlights-from-the-all-core-developers-execution-acde-call-225/",
      "site_name": "EtherWorld.co",
      "favicon": "https://etherworld.co/content/images/size/w256h256/2023/03/new-logo--3--2.png",
      "description": "A comprehensive breakdown of ACDE #225 detailing Fusaka incident analysis, Glamsterdam scoping decisions, FOCIL process debates, and the roadmap toward the Heka upgrade."
    },
    {
      "title": "Daily General Discussion December 04, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1pdse8b/daily_general_discussion_december_04_2025/",
      "published": 1764828048.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "🚀 Ethereum Fusaka is Live: The “Unsung Hero” Upgrade You Need to Know About",
      "author": "confusedcoin",
      "url": "https://www.reddit.com/r/ethereum/comments/1pe4hqt/ethereum_fusaka_is_live_the_unsung_hero_upgrade/",
      "published": 1764865827.0,
      "thumbnail": null,
      "external_url": "https://vamshi.medium.com/ethereum-fusaka-is-live-the-unsung-hero-upgrade-you-need-to-know-about-40d8ca39bce2",
      "site_name": "vamshi.medium.com",
      "favicon": null,
      "description": null
    },
    {
      "title": "Sony launches Stablecoin! 🎮 USDSC lists on Ethereum L2!",
      "author": "renkure",
      "url": "https://www.reddit.com/r/ethereum/comments/1pdxj1w/sony_launches_stablecoin_usdsc_lists_on_ethereum/",
      "published": 1764847299.0,
      "thumbnail": null,
      "external_url": "https://ecency.com/@pichat/sony-launches-stablecoin-usdsc-lists-on-ethereum-l2-9sh",
      "site_name": "ecency.com",
      "favicon": null,
      "description": null
    },
    {
      "title": "Fusaka Infographic 🦓 13 EIPs, one massive ethereum upgrade!",
      "author": "trent_vanepps",
      "url": "https://www.reddit.com/r/ethereum/comments/1pdfavo/fusaka_infographic_13_eips_one_massive_ethereum/",
      "published": 1764793245.0,
      "thumbnail": "https://preview.redd.it/jccnmgz6s15g1.png?width=640&crop=smart&auto=webp&s=4eb8835504ddebb4a0f6a8605a86b71b32c6b616",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "a wonderful fusaka day to you all - original post if you want to help boost on twitter!"
    },
    {
      "title": "How is Ethereum solving the blockchain trilemma? Post Fusaka upgrade analysis.",
      "author": "Worldly-Law9012",
      "url": "https://www.reddit.com/r/ethereum/comments/1pdra4c/how_is_ethereum_solving_the_blockchain_trilemma/",
      "published": 1764824506.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Ethereum is actively working to address the blockchain trilemma, a core challenge in the design of decentralized systems that suggests a blockchain can only achieve two of three key properties—Decentralization, Security, and Scalability—at the same time. Ethereum's strategy involves a multi-phased roadmap and the heavy utilization of Layer 2 (L2) scaling solutions to tackle scalability while maintaining its core commitments to decentralization and security. 🛡️ Security and Decentralization Ethereum's foundational layer, or Layer 1 (L1), prioritizes security and decentralization, which are fundamental to its value proposition as a \"world computer.\" Security: The network transitioned from a Proof-of-Work (PoW) consensus mechanism to Proof-of-Stake (PoS), known as The Merge (September 2022). PoS maintains a high level of security by making it prohibitively expensive for a malicious actor to gain enough staked ETH to compromise the network. The economic cost of an attack on Ethereum's PoS network is arguably higher than on its former PoW network. Decentralization: PoS is intended to boost decentralization in the long run by making it easier for more people to become validators, as it requires less specialized, expensive hardware compared to PoW mining. The development roadmap also includes phases like The Scourge and The Purge, which aim to further improve censorship resistance and reduce the hardware requirements for running a node, promoting wider network participation. 🚀 Scaling (Solving the Trilemma's Third Side) Ethereum's main challenge was scalability—the network became congested, leading to slow transactions and high gas fees. The strategy to address this is primarily through Layer 2 solutions and fundamental L1 upgrades. Layer 2 (L2) Scaling Solutions Ethereum leans heavily on L2 networks, which process transactions off the main chain but settle on L1, inheriting Ethereum's robust security. Rollups: These are the most prominent L2 solution. They execute thousands of transactions off-chain and then bundle (\"roll up\") the resulting data into a single, compressed transaction that gets submitted back to the Ethereum Mainnet. Optimistic Rollups (e.g., Arbitrum, Optimism): Assume transactions are valid but allow a \"challenge period\" where anyone can submit a fraud proof if they detect an invalid transaction. Zero-Knowledge (ZK) Rollups (e.g., zkSync, Starknet): Use cryptographic proofs (validity proofs) to instantly verify the correctness of off-chain transactions, providing stronger security guarantees. By offloading the execution layer to L2s, Ethereum L1 can focus on its role as the secure and decentralized data availability layer. Layer 1 Upgrades Ethereum's roadmap includes major L1 upgrades to support the L2 scaling strategy: Proto-Danksharding (EIP-4844): Implemented in the Dencun upgrade (March 2024), this introduced a new, cheaper way for rollups to post transaction data to the L1 using \"blobs\". This significantly lowered L2 transaction costs, boosting scalability without compromising security or decentralization. The Surge (Full Sharding): The long-term vision involves a form of data sharding where the network is split to handle data more efficiently. This will dramatically increase the data capacity of the L1, further scaling the L2 ecosystem to potentially handle hundreds of thousands of transactions per second (TPS). In essence, Ethereum is solving the trilemma by adopting a layered approach: L1 provides decentralized security, and L2s provide scalability."
    }
  ],
  "fetched_at": "2025-12-05T15:37:58.498526+00:00"
}