{
  "subreddit": "Bitcoin",
  "posts": [
    {
      "title": "Important for new comers",
      "author": "Substantial_Car_7483",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pabouf/important_for_new_comers/",
      "published": 1764485370.0,
      "thumbnail": "https://preview.redd.it/ft3bruywcc4g1.jpeg?width=320&crop=smart&auto=webp&s=89b3b16a968d1718e002b97ce4b804e975fb1a1d",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Bitcoin is not a get rich quick scheme. Its important to understand why it is what it is. This old picture cam across, so I thought to share it here. It has a deep meaning"
    },
    {
      "title": "“If I put $100 in Bitcoin in 2010 I’d have $2.8B now.” No.",
      "author": "Apprehensive_Shoe_86",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pa9f7n/if_i_put_100_in_bitcoin_in_2010_id_have_28b_now_no/",
      "published": 1764477772.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "If you bought $100 of Bitcoin in 2010 and watched it go to: $1k → $100k → $1.7M and did nothing Then watched $1.7M go to $170k and still did nothing Then watched $170k go to $110M and still did nothing Then watched $110M wither to $18M and still did nothing Then watched $18M surge to $390M and still did nothing Then watched $390M deteriorate to $85M Then watched $85M climb to $1.6B and still did nothing Then watched $1.6B shrink to $390M and still did nothing Then watched $390M surge to $2.8B and then for some reason finally decided to do something… Then yes, $100 in 2010 would be worth $2.8B today."
    },
    {
      "title": "Bitcoin in the wild",
      "author": "The_Finance_Pro",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pa5kyp/bitcoin_in_the_wild/",
      "published": 1764466001.0,
      "thumbnail": "https://preview.redd.it/dglqornbra4g1.jpeg?width=640&crop=smart&auto=webp&s=a35ba3ae9e6c09a426336d729b5182036bb1e125",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "I saw this Bitcoin machine. Has anyone ever tried one like this? Was actually thinking of buying one. Does anyone have any experience with owning one?"
    },
    {
      "title": "TIL Bitfinex recovered ~$3 billion of customers stolen bitcoin and did not return it. \"As far as Bitfinex is concerned, we've made our customers whole.\" from Netflix documentary, \"Biggest Heist Ever\"",
      "author": "rgnet1",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1p9th85/til_bitfinex_recovered_3_billion_of_customers/",
      "published": 1764434656.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "tl;dr Hackers broke into Bitfinex in 2016 and stole 120,000 BTC ($75m at the time) directly from customer accounts. Law enforcement recovered 96,000 BTC in 2022, now worth $3.5bn. They returned a bulk of it back to Bitfinex. Bitfinex did not return the bitcoin to its customers, but instead provided them redeemable tokens for the value of the bitcoin at the time it was stolen. (Even worse: \"Redeemable as quickly as we can.\") I usually call people who yell \"not your keys, not your coins\" too alarmist. Exchanges must be held accountable. They are 100% not being held accountable. This should be a massive lawsuit to permanently determine that if bitcoin as property CAN be returned then it MUST be returned, not the value in dollars at time of loss. You can watch the slimy Bitfinex executive explain this directly at 1hr13 in the documentary, by the way."
    },
    {
      "title": "He'll tell you about the future",
      "author": "Glabkrar_the_Unholy",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pafwwr/hell_tell_you_about_the_future/",
      "published": 1764501435.0,
      "thumbnail": "https://preview.redd.it/9cr1mz3fod4g1.jpeg?width=640&crop=smart&auto=webp&s=ad609203e46094f4750000d1df78ba5ec7f3df9c",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "My understanding of China “banning” Bitcoin, again",
      "author": "EmbarrassedYak1110",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pahg0t/my_understanding_of_china_banning_bitcoin_again/",
      "published": 1764506717.0,
      "thumbnail": "https://preview.redd.it/q9zs0c8e4e4g1.jpeg?width=640&crop=smart&auto=webp&s=2abdd3d25c2174ebc42c21322cf6ac126f11f9d4",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "With assistance of AI"
    },
    {
      "title": "We are BITCOINERS!",
      "author": "MrMBTC",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1p9wp5d/we_are_bitcoiners/",
      "published": 1764442539.0,
      "thumbnail": "https://preview.redd.it/6bdsqa6kt84g1.jpeg?width=640&crop=smart&auto=webp&s=8819c45823973cb08a154258396a38f2ef769d0e",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "\"I will not risk my dollars\"",
      "author": "wow_true",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1pa2tgu/i_will_not_risk_my_dollars/",
      "published": 1764458285.0,
      "thumbnail": "https://preview.redd.it/y5z8tiq04a4g1.png?width=640&crop=smart&auto=webp&s=4c7d6c39b4d36775a2f4f9e9cb9f93d6f378cd88",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "China banned Bitcoin again… must be bull season 😂",
      "author": "JcTrismegistus",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1p9vpu4/china_banned_bitcoin_again_must_be_bull_season/",
      "published": 1764440154.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Another year, another headline: “China says Bitcoin has no legal status.” Bro… they’ve banned Bitcoin like 9 times already. Every cycle it’s the same script: • China FUD • Panic headlines • “Speculation crackdown” • And then… Number. Goes. Up. If a government with that level of control still feels threatened enough to repeat the same warning over and over… That tells you everything about Bitcoin’s trajectory. I don’t sell. I only buy. Let them ban it every month — the protocol doesn’t care. Blocks keep coming in every 10 minutes. ⚡️ What do you think: Classic FUD or something deeper this time?"
    },
    {
      "title": "Three lessons from Bitcoin octopus 🐙",
      "author": "Able-Upstairs-9875",
      "url": "https://www.reddit.com/r/Bitcoin/comments/1p9q8zv/three_lessons_from_bitcoin_octopus/",
      "published": 1764426443.0,
      "thumbnail": "https://preview.redd.it/lwcbb71ph74g1.jpeg?width=640&crop=smart&auto=webp&s=a3b21d106b44d8e399aeab73899a8b7b0922f5b4",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Early 40’s man that has been in BTC since 2017. The longer I’ve been in crypto the more of a BTC maxi I’ve become. I’ve made most of the mistakes along the way which is part of the learning curve most need to take. Today I purchased another .2 at the highest price I’ve bought yet. There are more and more people like me. Who are buying with the intention of not selling for many years, if at all. I’ve personally never sold. Here are three lessons I’d tell my younger self as it seems most people here are in their 20’s. Think longterm. Don’t try to be a trader unless you are an expert. Just buy, store in cold storage and forget for the next 10+ years. In 10 years you won’t remember or care if you bought at 60k, 90k, or 125k. Trying to time the market is just going to mess up your head and you will most likely screw it up. The term HODL has been around for years for a reason, because it works. Invest aggressively in your 20’s and 30’s. If I was in my 20’s right now, I’d be doing everything I could to save more fiat to buy more Bitcoin. Don’t buy the new car, nice watch, house or unnecessary credit card debt. The “we only live once” mentality is all fun and games until you’re over 40 with no assets. It really is wild what compounding and time does if you start early and aggressively. Investing is only “scary” until you realise the money is broken and everything is going up priced in fiat. Your 40 year old self will thank you. FUD will fack you up. You might be sitting here thinking I wish Bitcoin would crash to 40k so I’d buy more. But if / when it does, everything on twitter, TV, YouTube will be telling you it’s going lower. You might buy the big dip and it will dip again 20% as soon as you hit the buy button. This will feel like you are lighting your money on fire.🔥 💸 It will take balls and strong conviction to keep buying on the way down. The last time BTC was at 16k, I had been buying all the way down until I was mentally and emotionally exhausted. Everyone was saying it’s going to 12k and unfortunately I believed them and stopped buying. If we get another deep bear market I’m going aggressive AF. I refuse to make the same mistake a third time. Bitcoin has been a big part of my life over the last 8 years. It’s not easy being a maxi when everyone around you thinks you’re a crazy gambler. I actually hate gambling 🎰. We all take risks in investing and I’d rather take a risk on BTC than just about anything else. I hope these tips help inspire a few young bitcoiners on the climb up. Happy stacking 👊🏻🤑"
    }
  ],
  "fetched_at": "2025-11-30T13:41:22.490763+00:00"
}