{
  "subreddit": "ethereum",
  "posts": [
    {
      "title": "Daily General Discussion November 28, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1p8ndob/daily_general_discussion_november_28_2025/",
      "published": 1764309671.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "Honest Opinions About Crypto Games",
      "author": "BodybuilderOk96",
      "url": "https://www.reddit.com/r/ethereum/comments/1p8twe2/honest_opinions_about_crypto_games/",
      "published": 1764333730.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "So crypto games have a bad rap in mainstream because of past scams. Also, a lot of them get criticized because of the poor gameplay quality, and because of the fact that they focus more on earning rather than the actual gameplay mechanics (which I agree with). However, using crypto seems beneficial because you can track all of the transactions on the blockchain online (nothing is hidden). If, for example, you do an esports type of tournament with a cash prize pool given to players, you can literally track how that pool is given to players on the blockchain. But without crypto, you have to trust the companies on how the pool is being distributed (because you don't know what their doing behind the scene). Also, the transaction fees with some crypto chains are pretty low (in the milli-cents, compared to using credit cards to buy in-game virtual currencies, like Fortnite VBucks)... But the fact that crypto games haven't taken off tells me that gamers really don't care about transparency and fees...They trust the centralized gaming companies/publishers, and are willing to pay premiums for skins and other in-game assets without being the true owners of those assets. As gamers, do you guys agree with this? Do you see any case where gamers would prefer to transition to crypto instead of traditional credit card systems?"
    },
    {
      "title": "Ethereal news weekly #0 | Gas limit increased to 60M, Fusaka upgrade December 3, FOCIL not in Glamsterdam upgrade",
      "author": "abcoathup",
      "url": "https://www.reddit.com/r/ethereum/comments/1p8szlr/ethereal_news_weekly_0_gas_limit_increased_to_60m/",
      "published": 1764330756.0,
      "thumbnail": "https://external-preview.redd.it/2zyY6e5Mf5R63ELydbdrYjrz_yIBJn5i9-GpP66kmzM.jpeg?width=640&crop=smart&auto=webp&s=5a0bcc467e92ab01c45c72e2085e5e0169e799e6",
      "external_url": "https://ethereal.news/ethereal-news-weekly-0/",
      "site_name": "ethereal.news",
      "favicon": "https://ethereal.news/favicon.svg",
      "description": "Gas limit increased to 60M, Fusaka upgrade December 3, FOCIL not in Glamsterdam upgrade"
    },
    {
      "title": "Highlights from the All Core Developers Consensus (ACDC) Call #170",
      "author": "Y_K_C_",
      "url": "https://www.reddit.com/r/ethereum/comments/1p8ohcl/highlights_from_the_all_core_developers_consensus/",
      "published": 1764313582.0,
      "thumbnail": "https://external-preview.redd.it/php-M-NLxCgSac5E4Dj2KndnspYHHF-ssha1g4RX4Us.jpeg?width=640&crop=smart&auto=webp&s=04992eed5e29f6a9028044f5370d1443bbc21a76",
      "external_url": "https://etherworld.co/2025/11/27/highlights-from-the-all-core-developers-consensus-acdc-call-170/",
      "site_name": "EtherWorld.co",
      "favicon": "https://etherworld.co/favicon.png",
      "description": "Ethereum developers juggle Fusaka launch, Glamsterdam finalization, & early Heka talks during ACDC #170."
    },
    {
      "title": "Looking for reliable handmade product suppliers in Morocco (for Etsy shop)",
      "author": "New_Support2867",
      "url": "https://www.reddit.com/r/ethereum/comments/1p8t5po/looking_for_reliable_handmade_product_suppliers/",
      "published": 1764331328.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "Daily General Discussion November 27, 2025",
      "author": "EthereumDailyThread",
      "url": "https://www.reddit.com/r/ethereum/comments/1p7umek/daily_general_discussion_november_27_2025/",
      "published": 1764223250.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Welcome to the Daily General Discussion on r/ethereum https://imgur.com/3y7vezP Bookmarking this link will always bring you to the current daily: https://old.reddit.com/r/ethereum/about/sticky/?num=2 Please use this thread to discuss Ethereum topics, news, events, and even price! Price discussion posted elsewhere in the subreddit will continue to be removed. As always, be constructive. - Subreddit Rules Want to stake? Learn more at r/ethstaker Community Links Ethereum Jobs, Twitter EVMavericks YouTube, Discord, Doots Podcast Doots Website, Old Reddit Doots Extension by u/hanniabu Calendar: https://dailydoots.com/events/"
    },
    {
      "title": "Part One of Can I Pay With This? A stablecoin experiment in Buenos Aires.",
      "author": "Twelvemeatballs",
      "url": "https://www.reddit.com/r/ethereum/comments/1p85ooe/part_one_of_can_i_pay_with_this_a_stablecoin/",
      "published": 1764259064.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Decentralized or Destitute This is Part One of an eight-part series. Table of Contents 1) Decentralized or Destitute <-- you are here Money, monkeys and mild terror 2) First Contact with Reality KYC on a hostel bunk bed 3) WE ACCEPT BITCOIN (sort of) My first on-chain candy 4) Eighteen Ways to Pay for Ice Cream Stablecoins, FX hell and a missing keyboard 5) Going Bankless From tourist shop hack to cueva contact 6) Trustless, My Ass Trading with the Blue Man 7) Custodial Services Self-custody is easy, luggage custody is hard 8) Apparently I Did It Wrong \"You should have just used X, bro.\" Buenos Aires is a beautiful city of wide avenues, striking architecture and a population that has come to terms with the fact that the peso has been in freefall for decades and banks can't be trusted. The economy is feral. Enter crypto. Devconnect 2025, the World's Fair for Ethereum, will be (or has been, by the time you are reading this) held in Buenos Aires, Argentina. Argentina is a place where Ethereum adoption is happening right now. People are using stablecoins and blockchain solutions for daily transactions and savings. Like many people interested in the culture of Ethereum, I have only scratched the surface of Decentralized Finance. DeFi, ranging from yield-bearing accounts to leverage trading to penguin NFTs. Ethereum, I'm told, is digital oil, the beginnings of a system that will change the way we interact with finance the way that the Internet has changed the way we interact with the world. It sounds amazing and futuristic: a sci-fi utopia. But right here, right now, the Ethereum Foundation says that people in Buenos Aires are using these solutions to buy coffee and bread and maybe a little salvation. Could I do that, too? Could I buy asado and wine with stablecoins? Toilet paper? I decide that I need to find out. I'll fly to Argentina and see if I could live on-chain, converting my carefully hoarded store of half an ETH to USDC. There's three parts to this. Decentralized: No single entity is in control. Permissionless: I cannot be denied access. Trustless: I don't need to have faith that the transaction will happen. How close can I get to that dream of the future of finance of walking the sunlit streets with nothing but a digital wallet and my own hunger? I call the challenge Decentralized or Destitute. I pack a backpack with three T-shirts, one pair of jeans and a cheap phone to hold a burner wallet. Also two debit cards, one credit card and an envelope full of cash. Because I am not brave and I've seen what happens to idealists in documentaries. Step one: get a place to sleep using crypto. Booking an apartment directly with a private owner fails immediately. The first person I contact rejects the offer without consideration. \"No cripto.\" Dollar, Euros or Pesos, but absolutely cash only. The second not only doesn't want crypto but doesn't want my business at all, just for asking. I'm going to have to use one of the travel platforms that offer this specifically. Unfortunately, the great savings of up to 60% off for paying with crypto are based on booking hotels of a slightly higher quality than I usually stay at. One excitedly tells me about the perfect place for me! And it's 44% off! Making for a very affordable $619.50 per night with 2% cashback. There seem to be very few options at my actual price range, which is more like $40 a night. Preferably with walls. Betrustly, a brand new booking platform designed for Argentina, gives me hope. I find a perfect room in a large co-living house: private bathroom, working areas, fantastic price and available for the dates I wanted. Except that I never receive a response. Customer support's advice is to book the place directly. They quickly reply to my direct contact: application only, the minimum stay is one month, and no, they do not take crypto. The Ether.fi travel portal finally gives me a break: a private room that actually exists, well-placed, well-priced. But when they say you can pay in crypto, they don't mean that you can pay in crypto. You have to have an Ether.fi card for that perk. Fine, I apply for the card. No. People who live in my country are not invited to the party. Desperate for a solution, I cave and pay with a DeFi card: it's Gnosis Pay, which is self-custodial (they can't lock me out of my finds) and allows me to pay for my hostel booking with stablecoins. Technically a win. But Gnosis Pay is a Visa card. A literal, physical card indistinguishable from the one issued by my bank. It feels like I won using training wheels and corporate logos. Friends and family express only minor concern at my plan. My best friend worries I'll get indoctrinated into a crypto cult. (Plausible.) My mother thinks that I might be in over my head. (Correct.) My aunt is concerned that I might have fallen for a romance scam. (Incorrect, but my DMs are open.) But to my surprise, the most urgent concerns for my safety come from a nurse at the Center for Infectious Diseases. There are no vaccine requirements for Argentina, but my doctor still advises a vist to the infectious disease clinic. I'm an immigrant in a European country where my language skills are somewhere between lost tourist and toddler, which makes this sort of appointment nervewracking. At the front desk, the receptionist asks at full volume what infectious disease I was being treated for and then waves me upstairs to meet with a nurse. I explain to the nurse that I don't speak the local language. She disagrees, pointing out that I'd just said I don't speak the language in the language. Fine. I haltingly explain that I am going to Argentina and sit back, my vocabulary expended. She pulls up a browser with the website for the US Government Center for Disease Control and Prevention already loaded and scans the English-language page on Argentina before helpfully translating the key points for me into the language I just said that I didn't speak. \"Do you know typhoid?\" she asks. \"A little,\" I say, as if we'd met at a party once. She rattles off instructions: don't drink the water, don't open my mouth while in the shower, disinfect my hands every time I wash them, don't eat [unintelligible]. I ask her repeat it. She says a word that I do not understand. She pauses, rephrases and then, finally acknowledging my lack of fluency, switches to English. \"Don't eat salads.\" Um, ok. \"Steak?\" I ask, grinning. \"Yes. Eat steak.\" She is not smiling. She shifts back to the local language to tell me we are definitely vaccinating me against yellow fever and hepatitis A. My consent is apparently not required. Then she gives me a long lecture about rabies in Argentina, but there are too many words I don't recognize. She goes back to English with a sigh. If I get bitten by a dog or a monkey, I must go straight to the hospital. I nod to let her know that I am taking her advice seriously, while wondering how likely it is that I will be bitten by a monkey attending an Ethereum conference in Buenos Aires and also, how is it that the nurse knows the English word for “monkey” but not the word for “uncooked food”? That's enough English, apparently. She quizzes me on my intentions. What am I doing there? Would I be with other people? Buenos Aires has a population of 16 million, so I am unlikely to be alone. But maybe this is a euphemistic phrase and she is working up to a talk on sexually transmitted diseases of Latin America. I admit yet again that I don't understand. “Are you travelling alone?” “Yes.” She asks me another question where I understood only two words: pleasure and risk. I blink at her in obvious confusion and she takes pity on me. “Do you like risk?” I bite my lip. It seems like a bad idea to admit to being a risk junkie in the Centre for Infectious Diseases. “No?” “Good!” She thinks for a moment and comes to a decision. “I think we will also give you the rabies shot.” With that, she pulls out a syringe. Apparently, the time for discussion is over. --- Next up: First Contact with Reality (KYC on a hostel bunk bed)"
    },
    {
      "title": "Cryptopia liquidation",
      "author": "Vivid_Wolverine2469",
      "url": "https://www.reddit.com/r/ethereum/comments/1p83pg9/cryptopia_liquidation/",
      "published": 1764254132.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "Layerbrett ( lbrett on ETH)",
      "author": "Fer_Pet",
      "url": "https://www.reddit.com/r/ethereum/comments/1p88vk0/layerbrett_lbrett_on_eth/",
      "published": 1764266762.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "Concentrated Liquidity (CL) Basics",
      "author": "bigrkg",
      "url": "https://www.reddit.com/r/ethereum/comments/1p7vq97/concentrated_liquidity_cl_basics/",
      "published": 1764227041.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    }
  ],
  "fetched_at": "2025-11-28T15:47:33.554809+00:00"
}