{
  "subreddit": "robotics",
  "posts": [
    {
      "title": "RIVR showing how last-mile delivery of the future might look like",
      "author": "Nunki08",
      "url": "https://www.reddit.com/r/robotics/comments/1pfmn8a/rivr_showing_how_lastmile_delivery_of_the_future/",
      "published": 1765018686.0,
      "thumbnail": "https://external-preview.redd.it/MXVyaXA5NzllazVnMUuxoCHg85KL0EcK9dpaD2YY59kuZedMgtj47WJTI5Oj.png?width=640&crop=smart&auto=webp&s=374a3746de4c5d279d7bbd59447b08a3216fde81",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Website: https://www.rivr.ai/ On 𝕏: https://x.com/rivr_tech"
    },
    {
      "title": "Zhongqing t800 robot vs human",
      "author": "Any_Calligrapher4649",
      "url": "https://www.reddit.com/r/robotics/comments/1pfnufq/zhongqing_t800_robot_vs_human/",
      "published": 1765023029.0,
      "thumbnail": "https://external-preview.redd.it/anhydnpndWZyazVnMbg9Bb3hXtebUT4QDWxa6gQMQuwTAp2TSoL1ooMbIQQy.png?width=320&crop=smart&auto=webp&s=8206864402098db1f7d430856ca8fe448eafe35a",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Zhongqing CEO Receives the Challenge of T800"
    },
    {
      "title": "Robot dance Arduino",
      "author": "Archyzone78",
      "url": "https://www.reddit.com/r/robotics/comments/1pfijsr/robot_dance_arduino/",
      "published": 1765003030.0,
      "thumbnail": "https://external-preview.redd.it/Y25rZXhqYTU0ajVnMbOJhgM30O6ZKO08DBReVskKOrZTZnYgzInYnly_IMMn.png?width=640&crop=smart&auto=webp&s=a5d2610b2998c92abb54372438ed197b1ea3537a",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "Sunday Robotics: Collecting Data Through the Memory-Developer Glove Before Building the Humanoid",
      "author": "marwaeldiwiny",
      "url": "https://www.reddit.com/r/robotics/comments/1pf9wv3/sunday_robotics_collecting_data_through_the/",
      "published": 1764976795.0,
      "thumbnail": "https://external-preview.redd.it/cWxrNjVwcmF4ZzVnMbtkBYuAaT2pID18gUmEoHrxBw0Oi--CtM_V6HPif-8k.png?width=640&crop=smart&auto=webp&s=9ce2592a6b294d95ba2654480fa0e1062241b765",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "https://youtu.be/UAlm8Z4mfpU"
    },
    {
      "title": "Knee assist exoskeleton motor",
      "author": "dumb_kid2784",
      "url": "https://www.reddit.com/r/robotics/comments/1pfl5ee/knee_assist_exoskeleton_motor/",
      "published": 1765012928.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Im working on an electric knee assist exoskeleton and i have a 450 rpm 24V 15kg*cm³ motor and i was wondering if it would be sufficient to show a noticeable difference for an average sized person when using the exoskeleton or will I need to use two motors."
    },
    {
      "title": "Unified Autonomy Stack - Open-Source Release",
      "author": "resrob",
      "url": "https://www.reddit.com/r/robotics/comments/1pfs13u/unified_autonomy_stack_opensource_release/",
      "published": 1765035176.0,
      "thumbnail": "https://a.thumbs.redditmedia.com/q-vE2K7yVloEuixMAgAbkM4sXF7hkaOYXSugHxz2Hi0.jpg",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Dear community, The Unified Autonomy Stack targets generalization across robot morphologies and operational domains. We’re excited to open-source the Unified Autonomy Stack - a step toward a common blueprint for autonomy across robot configurations in the air, on land (and soon at sea). The stack centers on three broadly applicable modules: Perception: a multi-modal SLAM system fusing LiDAR, radar, vision, and IMU, complemented by VLM-based scene reasoning for object-level understanding and mission context. Planning: multi-stage planners enabling safe navigation, autonomous exploration, and efficient inspection planning in complex environments. Navigation & Multi-layered Safety: combining map-based collision avoidance and reactive navigation — including (a) Neural SDF-based NMPC (ensuring collision-free motion even in unknown or perceptually degraded spaces), (b) Exteroceptive Deep RL, and (c) Control Barrier Function-based safety filters. Validated extensively on rotary-wing and ground robots such as multirotors and legged robots (while several of its modules are also tested on fixed-wing aircraft and underwater ROVs), the stack has demonstrated resilient autonomy in GPS-denied and challenging field conditions. To support adoption, we additionally release UniPilot, a reference hardware design integrating a full sensing suite, time-synchronization electronics, and high-performance compute capable of running the entire stack with room for further development. This open-source release marks a step toward a unified autonomy blueprint spanning air, land, and sea. Repository: https://github.com/ntnu-arl/unified_autonomy_stack Documentation: https://ntnu-arl.github.io/unified_autonomy_stack/ We hope you find this useful for your research!"
    },
    {
      "title": "AGIBOT D1 Pro",
      "author": "Nunki08",
      "url": "https://www.reddit.com/r/robotics/comments/1peuynn/agibot_d1_pro/",
      "published": 1764941052.0,
      "thumbnail": "https://external-preview.redd.it/ZGlmbmhkbHR5ZDVnMcmTqcCmyGxlIJwbMAh9zRk_vOBdKNEWQVCUcGUjD1SH.png?width=640&crop=smart&auto=webp&s=8467a4161ee66696616b006012bb7f536eb613b3",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "AGIBOT on 𝕏: AGIBOT D1 Pro/Edu Quadruped Robot is not only a reliable helper for scientific research and education but also an eye-catcher for entertainment companionship and commercial demonstrations～ 3.5m/s fast running, 1-2 hours battery life, IP54 dustproof & waterproof, durable and easy to use!: https://x.com/AgiBot_zhiyuan/status/1996928040182464537"
    },
    {
      "title": "Arduino Nano quadcopter build help",
      "author": "Blorglue",
      "url": "https://www.reddit.com/r/robotics/comments/1pfk3x2/arduino_nano_quadcopter_build_help/",
      "published": 1765008838.0,
      "thumbnail": "https://b.thumbs.redditmedia.com/J3qB6YAlcRqT5TebIymaq3ZrGBWskzTLrHXLiGC70uU.jpg",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Hella everyone! I've been building this drone as my own personal test on my engineering knowledge as I've just finished my mechatronic systems engineering degree. Sorry if the post is too long but here is a TLDR: TLDR: My motors won't spin, arduino logic and wiring should be correct as it worked with an older QBRAIN 4in1 ESC. Suspecting one of my cells in my 3S battery to be dead. Initialization tone is heard but no arming tone and writing esc.writeMicroseconds(1000); in the loop. Also tried 1500us and 2000us. Still doesn't work. ---------------------------------------------------------------------------------------------------- Here is a list of components: Arduion Nano: CH340 chip and ATmega328P ESC: Radiolink FlyColour 4 in 1 ESC (EFM8BB21 MCU, 8-bit C8051 core) Motors: 4x 900Kv BLDC motors (No idea what brand, I just found them) RX/TX: FlySky iA6B receiver and FS-i6X transmitter Gyro: MPU-6050 Buck converter: LM2596 ---------------------------------------------------------------------------------------------------- My setup: I've got the arduino outputting PWM signals into my ESC's motor signal pins which has been mapped to 1000-2000us before being sent into the ESC. (I dont have an oscilloscope to verify) The arduino is powered through the buck converter which sees the full Lipo battery voltage at the input (Stepped down to 5v for the arduino and grounded at arduino gnd) The ESC is powered directly from the Lipo battery and I've connected one of the two grounds leading OUT of the ESC's jst connector into the arduino ground. M1 signal wire is connected to D8 of my arduino and M1 is the only one that is plugged in and powered by the ESC At the moment I just want to be able to command the motor speed through the arduino, no PID control, no serial UART communications just yet. ---------------------------------------------------------------------------------------------------- My Problem: I can hear the motors play the initalization musical tone, but no subsequent beeps for self test or arming and it will not spin. When using the exact same setup on an older QBRAIN 4 in 1 ESC it all worked. Including my PID control and iBUS UART communication. Except the arduino needed to be powered through the ESC's regulator instead of the battery + buck converter combo. ---------------------------------------------------------------------------------------------------- My Theory: One of the 3 cells on my battery is dead, ESC is not getting enough voltage and I'm an idiot ESC boots faster than arduino can and goes into fail safe mode EMI between the logic and power grounds Arduino can't output a fast enough PWM signal If anyone could point me in the right direction to troubleshoot it would be greatly appreciated. I will go buy a new battery in the morning to see if that is the problem. However in the meantime if anyone could point out any wiring issues from what I've described or if you require any more specific information about my setup please let me know. Otherwise feel free to criticize, hate or provide constructive suggestions to my project. ---------------------------------------------------------------------------------------------------- Extra questions: Is the arduino nano even a suitable MCU for this application? From my research it seems like there is not enough of a safety margin in terms of cycles/second to do PID math, read gyro data and send fast PWM signals. If anything is bunged out of order it could lead to a positive feedback loop and crash my drone Since it is an engineering project and not a drone building project I'd like to use something that i can program. What other microcontrollers can work in place of the nano? (Preferrably not something I need to use assembly and design an MCU from scratch, thats a whole another project) https://preview.redd.it/qdwmnaiw9j5g1.jpg?width=3024&format=pjpg&auto=webp&s=f7871ed8a913dcf55e474cf7cdb7787240a3b9c3"
    },
    {
      "title": "Art installation draws attention for its robot dogs with famous faces",
      "author": "nbcnews",
      "url": "https://www.reddit.com/r/robotics/comments/1pe56c3/art_installation_draws_attention_for_its_robot/",
      "published": 1764867378.0,
      "thumbnail": "https://external-preview.redd.it/cTJ2N2RidXF3NzVnMa2NkyWLusU3EEB1G1quIu5uMib9yhFcaTJpvX4KlXi-.png?width=640&crop=smart&auto=webp&s=5c4b356e7b7139ee64c4e5a27f5c0e40298e7324",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": null
    },
    {
      "title": "Making a Marauder's Map from Harry Potter",
      "author": "davesarmoury",
      "url": "https://www.reddit.com/r/robotics/comments/1pf1agl/making_a_marauders_map_from_harry_potter/",
      "published": 1764956101.0,
      "thumbnail": "https://external-preview.redd.it/lkbyF5afhW6Htup7fUyNQVABCSEpJ946WVXQNrql7uM.jpeg?width=320&crop=smart&auto=webp&s=7bd8c748c2ede63e1e653ef9114a146b3f7c00ea",
      "external_url": "https://www.youtube.com/watch?v=dO32ImnsX-4",
      "site_name": "youtube.com",
      "favicon": "https://www.youtube.com/s/desktop/db7db827/img/favicon.ico",
      "description": "Arthur C. Clarke said \"Any sufficiently advanced technology is indistinguishable from magic\". This is the perfect example of that. We are taking a magical map that previously could only exist in a magical world and bringing it to life using robots, DeepStream, and multiple A6000 GPUs!"
    }
  ],
  "fetched_at": "2025-12-06T15:40:49.401256+00:00"
}