{
  "subreddit": "robotics",
  "posts": [
    {
      "title": "Waymo self-driving car enters active police standoff with passenger inside",
      "author": "BuildwithVignesh",
      "url": "https://www.reddit.com/r/robotics/comments/1pcz5ba/waymo_selfdriving_car_enters_active_police/",
      "published": 1764751715.0,
      "thumbnail": "https://external-preview.redd.it/dGsxcHM0MXdjeTRnMQzCE-oKnmX0A0tzj78iO1FrgUK3uFro-tgp7j8i7UI-.png?width=640&crop=smart&auto=webp&s=6c04322bd908a9bd161244d22c7a57aae89950a5",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Videoshows a driverless Waymo entering a police felony stop perimeter in Downtown LA. The Incident: The vehicle navigated just a few feet from officers during a tense standoff while a suspect was on the ground. The Failure: The planner technically worked (it didn't hit anyone) but it completely failed to read the room. It highlights that current AVs have zero concept of danger or social context beyond basic geometry. Outcome: Passengers were safe, but officers had to shout commands at a car that couldn't understand the urgency. Source : NBC News 🔗: https://www.google.com/amp/s/www.nbcnews.com/news/amp/rcna246994"
    },
    {
      "title": "I’m building a browser-based robotics playground (open source). You can test robots with zero setup.",
      "author": "Silly_Asparagus_76",
      "url": "https://www.reddit.com/r/robotics/comments/1pcwp3c/im_building_a_browserbased_robotics_playground/",
      "published": 1764742597.0,
      "thumbnail": "https://external-preview.redd.it/OHRobHR2ZmtseDRnMVhn10-Nc1-9KriehFOzrubxZY11FK4j-7-Mf4lOMvGA.png?width=640&crop=smart&auto=webp&s=71a081a0112389c9327782bec9d6515fec72cadb",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "I’m making a small open-source robotics playground that runs in the browser. It started as a fun idea and somehow turned into a physics sandbox where you can drive robots without installing anything. I want to add a few more robot types, but I’m not sure what would actually be fun or interesting to try. What robots should I add next? Just curious what people here would enjoy testing."
    },
    {
      "title": "New video, Optimus running. Looking way smoother now!",
      "author": "AlbatrossHummingbird",
      "url": "https://www.reddit.com/r/robotics/comments/1pcm1tm/new_video_optimus_running_looking_way_smoother_now/",
      "published": 1764713079.0,
      "thumbnail": "https://external-preview.redd.it/OGZ3cHp4Z3o1djRnMZtT1cI8u5hSVYJJ8bJ_LbGeT_t5WDj3OAKPszcxmQqg.png?width=640&crop=smart&auto=webp&s=b8bb0d900e82171ab90eb2762270f41578a44522",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Not sure if that's version 2 or 3, maybe someone can elaborate in the comments."
    },
    {
      "title": "Any ideas why urdf-stl looking incorrect in FoxGlove but correct in RVIZ2?",
      "author": "alarin",
      "url": "https://www.reddit.com/r/robotics/comments/1pcvoik/any_ideas_why_urdfstl_looking_incorrect_in/",
      "published": 1764739228.0,
      "thumbnail": "https://a.thumbs.redditmedia.com/MP4o24AtsWMvHnUvuTqq_r0lh1f44SgNzL8ZaaIDbQ4.jpg",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "First image FoxGlove, second RVIZ2 URDF generated by onshape2urdf URDF https://github.com/ogonek-spider/ros2/blob/master/spider_description/robot.urdf"
    },
    {
      "title": "Tying your shoes on a real bimanual mobile robot! ByteDance Seed just drops GR-RL, a new VLA+RL system that manages long-horizon precise dexterous manipulation of deformable objects (paper)",
      "author": "Nunki08",
      "url": "https://www.reddit.com/r/robotics/comments/1pc8kdi/tying_your_shoes_on_a_real_bimanual_mobile_robot/",
      "published": 1764682451.0,
      "thumbnail": "https://external-preview.redd.it/d2dvMjR0amlsczRnMaCiBgwQLnOBGKXTF1DSXq7q_DiQjpxh0SG0ta2h6icx.png?width=640&crop=smart&auto=webp&s=4294f9750a48be1dc1824d642e67aeeb5baded6b",
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Project page: https://seed.bytedance.com/en/gr_rl ArXiv: https://arxiv.org/abs/2512.01801"
    },
    {
      "title": "Inside China’s Robot Training Factory: Where Humanoids Learn to Work",
      "author": "GreatPretender1894",
      "url": "https://www.reddit.com/r/robotics/comments/1pctstu/inside_chinas_robot_training_factory_where/",
      "published": 1764733499.0,
      "thumbnail": "https://external-preview.redd.it/zqij42YEOUkK573YxCiBOsTzthGa7TikScFmfbM-ljU.jpeg?width=640&crop=smart&auto=webp&s=2b3e5dfd5755bdaf6499a227daabffa9505cdaf7",
      "external_url": "https://www.sixthtone.com/news/1017920",
      "site_name": "#SixthTone",
      "favicon": "https://www.sixthtone.com/favicon.ico",
      "description": "Young operators remotely guide robots through thousands of everyday tasks, generating the scarce data needed to teach machines how to work in the real world."
    },
    {
      "title": "Hello I'm new here and is this idea possible?",
      "author": "notsomeoneyouknowof",
      "url": "https://www.reddit.com/r/robotics/comments/1pd0kyr/hello_im_new_here_and_is_this_idea_possible/",
      "published": 1764757245.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "Me and my friend have this idea that we would turn a vacuum roomba or something (open for alternatives), into basically something that can see and talk. We were thinking of putting speakers and cameras and somehow make it work, as for the voice we were thinking of using a Teto voicebank I'd also like to say we have no experience about these so I hope for some really detailed insights, we are also open for any suggestions as long as we could make this idea (or something similar) be brought to life!"
    },
    {
      "title": "First robotics project: I want to make my lawnmower remote control",
      "author": "VegetableDistrict576",
      "url": "https://www.reddit.com/r/robotics/comments/1pct4rl/first_robotics_project_i_want_to_make_my/",
      "published": 1764731594.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "I want to make my ride on lawn mower remote control. My plan is to use stepper motors for steering and speed control lever actuation and hopefully use my drone controller(elrs, boxer) and a flight controller to connect reciever and send signal to stepper controllers. I think my main question here is: are there software programs similar to betaflight that allow my to load firmware to my fc and control/program it in a different way then you would do for a drone. And second question: does this sound feasable, and are there better methods of achieving this."
    },
    {
      "title": "Looking for a Coding Robot",
      "author": "Ill_Start6386",
      "url": "https://www.reddit.com/r/robotics/comments/1pcqymd/looking_for_a_coding_robot/",
      "published": 1764725597.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "The 11 year old is pretty smart and wants one of those robot arms. She has done some robotics and coding at school and wants to go into some type of engineering. I don’t like buying cheap stuff and I also don’t like buying something that she will build and be done with it. I guess what I’m looking for is some modular building kits to ultimately get her a robot arm type system that she can also modify over time. My goal is to stay $150 or less on the initial purchase and then it have options that she can add to this and have it grow along with her skills in doing this. I can’t find any shops around here anymore that could even help me with this and online has too many of these in such a wide price range I have no clue where to start. Maybe that is also a possibility to have books that she can read that could guide her through years of growing and learning with this. Any help would be appreciated."
    },
    {
      "title": "Industrial Robots vs Cobots in High Volume Production - Are Cobots even relevant here?",
      "author": "whynotabtn",
      "url": "https://www.reddit.com/r/robotics/comments/1pcdcul/industrial_robots_vs_cobots_in_high_volume/",
      "published": 1764693828.0,
      "thumbnail": null,
      "external_url": null,
      "site_name": null,
      "favicon": null,
      "description": "All the research I've done comparing the two shows that industrial robots are far superior to cobots in high-volume production. Industrial robots have higher payload, better reach range, speed range, repeatability, and they meet cycle time goals better. It seems like cobots win on safety as no cages are required, are easier to program, and easier to redeploy. What even is the point of an industry - say, automotive manufacturing - adopting cobots? Some quality inspection work? Packaging? Deburring? What practical applications can justify the cost/ deployment/ maintenance costs of a cobot?"
    }
  ],
  "fetched_at": "2025-12-03T11:25:18.618370+00:00"
}